{
  "inputs": {
    "age": "Age in years at the time of risk estimation. Age is a primary driver of absolute cardiovascular and kidney risk.",
    "sex": "Biological sex (male/female). The KFRE and PREVENT equations use sex-specific coefficients.",
    "eGFR": "Estimated Glomerular Filtration Rate (mL/min/1.73m²), a measure of kidney function. Lower values indicate worse kidney function.",
    "uACR": "Urine Albumin-to-Creatinine Ratio (mg/g). A higher uACR indicates greater albuminuria and higher kidney and cardiovascular risk.",
    "sbp": "Systolic Blood Pressure (mmHg). PREVENT uses non-linear terms that capture risk at both higher and lower SBP values.",
    "totalCholesterol": "Total cholesterol (mg/dL). Used with HDL to compute non–HDL cholesterol for PREVENT.",
    "hdlCholesterol": "High-Density Lipoprotein cholesterol (mg/dL). Higher HDL is generally protective in the PREVENT equations.",
    "diabetes": "Presence of diabetes mellitus (true/false). Increases predicted cardiovascular and heart failure risk in PREVENT.",
    "smoking": "Current smoking status (true/false). Increases predicted ASCVD and CVD risk in PREVENT.",
    "bmi": "Body Mass Index (kg/m²). PREVENT uses non-linear BMI terms in the HF equation.",
    "onAntihypertensive": "Currently taking antihypertensive therapy (true/false). Included in PREVENT to reflect treated blood pressure.",
    "onStatin": "Currently taking a statin (true/false). Included in PREVENT to reflect on-treatment lipids/therapy status.",
    "calcium": "Serum calcium (mg/dL). Included in the 8-variable KFRE.",
    "phosphate": "Serum phosphate (mg/dL). Included in the 8-variable KFRE.",
    "albumin": "Serum albumin (g/dL). Included in the 8-variable KFRE (converted to g/L in the equation).",
    "bicarbonate": "Serum bicarbonate (mEq/L). Included in the 8-variable KFRE."
  },

  "outputs": {
    "krfe": "KFRE returns the predicted probability (%) of kidney failure (dialysis or transplant) within 2 years and within 5 years. A clinical 'risk level' label may also be shown for convenience.",
    "prevent": "PREVENT returns 10-year risks (%): Total CVD (composite), ASCVD (MI/stroke/CV death), and Heart Failure (HF).",
    "kdigo": "KDIGO returns annual incidence rates (events per 1000 person-years) for: (1) Cardiovascular mortality and (2) CKD progression, based on eGFR–uACR category ('heat map')."
  },

  "formulas": {
    "krfe": "KIDNEY FAILURE RISK EQUATION (KFRE)\n\nOVERVIEW\nThe KFRE estimates the probability of kidney failure (dialysis or transplant) within 2 and 5 years. Two versions are implemented: a 4-variable model and an 8-variable model.\n\n────────────────────────────────────────────────\nA) 4-VARIABLE KFRE (Tangri et al., JAMA 2011)\nInputs: Age (years), Sex (male=1, female=0), eGFR (mL/min/1.73m²), uACR (mg/g)\n\nDefine:\n  Sex_male = 1 if male, else 0\n  lnACR   = ln(uACR in mg/g)\n\nLinear predictor (Score4):\n  Score4 = -3.0\n           + 0.067 × (Age - 50)\n           + 0.36  × (Sex_male)\n           - 0.065 × (eGFR - 30)\n           + 0.45  × (lnACR - 3)\n\nBaseline survivals:\n  S0(2y) = 0.929\n  S0(5y) = 0.772\n\nPredicted risks:\n  Risk_2y  = 1 - [ S0(2y) ]^( exp(Score4) )\n  Risk_5y  = 1 - [ S0(5y) ]^( exp(Score4) )\n\nReport:\n  2-Year Kidney Failure Risk (%) = 100 × Risk_2y\n  5-Year Kidney Failure Risk (%) = 100 × Risk_5y\n\n────────────────────────────────────────────────\nB) 8-VARIABLE KFRE (Tangri et al., JAMA 2011)\nInputs: Sex (male=1, female=0), Age (years), eGFR (mL/min/1.73m²),\n        uACR (mg/g), Calcium (mg/dL), Phosphate (mg/dL),\n        Albumin (g/dL), Bicarbonate (mEq/L)\n\nTransformations:\n  male          = 1 if male, else 0\n  age10         = Age / 10\n  egfr5         = eGFR / 5\n  lnACR         = ln(uACR in mg/g)\n  albumin_gL    = Albumin × 10  (convert g/dL → g/L)\n\nCentering means (from derivation):\n  mean_male       = 0.56422\n  mean_age10      = 7.0355\n  mean_egfr5      = 7.2216\n  mean_lnACR      = 5.2774\n  mean_calcium    = 9.351\n  mean_phosphate  = 4.445\n  mean_albumin_gL = 38.3\n  mean_bicarb     = 23.3\n\nCoefficients (β):\n  β_male        =  +0.16117\n  β_age10       =  -0.19883\n  β_egfr5       =  -0.49360\n  β_lnACR       =  +0.35066\n  β_calcium     =  -0.22129\n  β_phosphate   =  +0.32040\n  β_albumin_gL  =  -0.08050\n  β_bicarbonate =  -0.03852\n\nLinear predictor (LP):\n  LP = β_male       × (male        - mean_male)\n     + β_age10      × (age10       - mean_age10)\n     + β_egfr5      × (egfr5       - mean_egfr5)\n     + β_lnACR      × (lnACR       - mean_lnACR)\n     + β_calcium    × (Calcium     - mean_calcium)\n     + β_phosphate  × (Phosphate   - mean_phosphate)\n     + β_albumin_gL × (albumin_gL  - mean_albumin_gL)\n     + β_bicarbonate× (Bicarbonate - mean_bicarb)\n\nBaseline survivals:\n  S0(2y) = 0.976\n  S0(5y) = 0.925\n\nPredicted risks:\n  Risk_2y = 1 - [ S0(2y) ]^( exp(LP) )\n  Risk_5y = 1 - [ S0(5y) ]^( exp(LP) )\n\nReport:\n  2-Year Kidney Failure Risk (%) = 100 × Risk_2y\n  5-Year Kidney Failure Risk (%) = 100 × Risk_5y",

    "prevent": "AHA PREVENT EQUATIONS (Khan et al., Circulation 2023)\n\nOVERVIEW\nPREVENT provides 10-year risks for:\n  • Total CVD\n  • ASCVD (MI, stroke, CV death)\n  • Heart Failure (HF)\nSex-specific logistic models are used. Risk = exp(log_odds) / (1 + exp(log_odds)).\n\nUnits and helper transforms:\n  • Lipids are entered in mg/dL but the equations use mmol/L terms.\n  • Convert using: mmol/L = mg/dL × 0.02586\n  • Define:\n      nonHDL_mmol = (TotalCholesterol - HDL) × 0.02586\n      HDL_mmol    = HDL × 0.02586\n  • SBP is in mmHg and enters as two piecewise-linear terms:\n      SBP_high  = (max(SBP, 110) - 130) / 20\n      SBP_low   = (min(SBP, 110) - 110) / 20\n  • eGFR is in mL/min/1.73m² and enters as two piecewise-linear terms:\n      eGFR_below60 = (eGFR - 60) / (-15)   if eGFR < 60, else 0\n      eGFR_above90 = (eGFR - 90) / ( 15)   if eGFR > 90, else 0\n  • Therapy/status indicators:\n      Diabetes, Smoking, On Antihypertensive, On Statin → (true=1, false=0)\n  • BMI (kg/m²) contributes only to the HF model with non-linear terms:\n      BMI_high  = max(0, (BMI - 30) / 5)\n      BMI_low   = min(0, (BMI - 25) / (-5))\n\nRISK = exp(log_odds) / (1 + exp(log_odds)) × 100%\n\n────────────────────────────────────────────────\nA) 10-YEAR TOTAL CVD RISK\n\nWomen:\n  log_odds =\n    -3.307728\n    + 0.7939329 × ((Age - 55) / 10)\n    + 0.0305239 × (nonHDL_mmol - 3.5)\n    - 0.1606857 × ((HDL_mmol - 1.3) / 0.3)\n    + 0.360078  × SBP_high\n    - 0.2394    × SBP_low\n    + 0.8667604 × Diabetes\n    + 0.5360739 × Smoking\n    + 0.6045917 × min(0, eGFR_below60)\n    - 0.285859  × max(0, eGFR_above90)\n    + 0.3151672 × On_Antihypertensive\n    - 0.1477655 × On_Statin\n\nMen:\n  log_odds =\n    -3.031168\n    + 0.7688528 × ((Age - 55) / 10)\n    + 0.0736174 × (nonHDL_mmol - 3.5)\n    - 0.0954431 × ((HDL_mmol - 1.3) / 0.3)\n    + 0.3362658 × SBP_high\n    - 0.1896749 × SBP_low\n    + 0.7692857 × Diabetes\n    + 0.4386871 × Smoking\n    + 0.5378979 × min(0, eGFR_below60)\n    - 0.219842  × max(0, eGFR_above90)\n    + 0.288879  × On_Antihypertensive\n    - 0.1337349 × On_Statin\n\nRisk_CVD_10y (%) = 100 × exp(log_odds) / (1 + exp(log_odds))\n\n────────────────────────────────────────────────\nB) 10-YEAR ASCVD RISK\n\nWomen:\n  log_odds =\n    -3.819975\n    + 0.719883  × ((Age - 55) / 10)\n    + 0.1176967 × (nonHDL_mmol - 3.5)\n    - 0.151185  × ((HDL_mmol - 1.3) / 0.3)\n    + 0.3592852 × SBP_high\n    - 0.198971  × SBP_low\n    + 0.8348585 × Diabetes\n    + 0.4831078 × Smoking\n    + 0.4864619 × min(0, eGFR_below60)\n    - 0.222378  × max(0, eGFR_above90)\n    + 0.2265309 × On_Antihypertensive\n    - 0.0592374 × On_Statin\n\nMen:\n  log_odds =\n    -3.500655\n    + 0.7099847 × ((Age - 55) / 10)\n    + 0.1658663 × (nonHDL_mmol - 3.5)\n    - 0.1144285 × ((HDL_mmol - 1.3) / 0.3)\n    + 0.3239977 × SBP_high\n    - 0.138406  × SBP_low\n    + 0.7189597 × Diabetes\n    + 0.3956973 × Smoking\n    + 0.3690075 × min(0, eGFR_below60)\n    - 0.165844  × max(0, eGFR_above90)\n    + 0.2036522 × On_Antihypertensive\n    - 0.0865581 × On_Statin\n\nRisk_ASCVD_10y (%) = 100 × exp(log_odds) / (1 + exp(log_odds))\n\n────────────────────────────────────────────────\nC) 10-YEAR HEART FAILURE RISK\n\nWomen:\n  log_odds =\n    -4.310409\n    + 0.8998235 × ((Age - 55) / 10)\n    + 0.3576505 × SBP_high\n    - 0.203102  × SBP_low\n    + 1.038346  × Diabetes\n    + 0.583916  × Smoking\n    + 0.2997706 × BMI_high\n    - 0.231922  × BMI_low\n    + 0.7451638 × min(0, eGFR_below60)\n    - 0.384594  × max(0, eGFR_above90)\n    + 0.3534442 × On_Antihypertensive\n\nMen:\n  log_odds =\n    -3.946391\n    + 0.8972642 × ((Age - 55) / 10)\n    + 0.3634461 × SBP_high\n    - 0.145789  × SBP_low\n    + 0.923776  × Diabetes\n    + 0.5023736 × Smoking\n    + 0.3726929 × BMI_high\n    - 0.217743  × BMI_low\n    + 0.6926917 × min(0, eGFR_below60)\n    - 0.315512  × max(0, eGFR_above90)\n    + 0.2980922 × On_Antihypertensive\n\nRisk_HF_10y (%) = 100 × exp(log_odds) / (1 + exp(log_odds))",

    "kdigo": "KDIGO PROGNOSIS (2011 CLASSIFICATION)\n\nOVERVIEW\nKDIGO stratifies prognosis using a cross-classification ('heat map') of eGFR (kidney function) and uACR (albuminuria). For each cell, incidence rates (events per 1000 person-years) are used for:\n  • Cardiovascular mortality\n  • CKD progression\n\nCATEGORIZATION\neGFR categories (mL/min/1.73m²):\n  >105, 90–105, 75–90, 60–75, 45–60, 30–45, 15–30\n\nuACR categories (mg/g):\n  <10, 10–29, 30–300, >300\n\nThe tool maps a patient's eGFR–uACR cell to the corresponding incidence rates (below). These are returned in events per 1000 person-years.\n\nCARDIOVASCULAR MORTALITY: events per 1000 person-years (rows: eGFR, columns: uACR)\n              <10     10–29    30–300   >300\n  >105        4.05     5.85     10.35    9.45\n  90–105      4.50     6.75      7.65   16.65\n  75–90       4.50     5.85      7.20   16.65\n  60–75       4.95     6.30      9.00   18.45\n  45–60       6.75     9.90     12.60   19.35\n  30–45       9.90    12.15     15.30   23.40\n  15–30      63.00    35.55     21.60   36.45\n\nCKD PROGRESSION: events per 1000 person-years (rows: eGFR, columns: uACR)\n              <10     10–29    30–300    >300\n  >105        0.00     0.00      0.808     6.060\n  90–105      0.00     0.00      1.818     6.666\n  75–90       0.00     0.00      3.838    10.100\n  60–75       0.00     0.00      6.464    16.362\n  45–60       6.262    8.080    18.988   115.140\n  30–45       6.060   38.380    30.300    44.440\n  15–30       8.080   24.240    42.420    15.554\n\nREPORTING\n• CVD Mortality: rate (events/1000 person-years) for the patient's cell\n• CKD Progression: rate (events/1000 person-years) for the patient's cell\n• eGFR and uACR categories are also returned for display"
  },

  "learn": {
    "ckm": {
      "title": "Cardiovascular–Kidney–Metabolic (CKM) Syndrome",
      "sections": {
        "overview": {
          "title": "Definition and Staging Framework",
          "content": "• CKM syndrome describes a unified clinical construct that links adiposity-related dysmetabolism, diabetes, chronic kidney disease, and cardiovascular disease along a single continuum of risk.\n• CKM staging provides a common language for risk-triggered prevention, moving patients from no risk factors to subclinical disease and ultimately to overt cardiovascular disease with or without kidney failure.\n• Stage 0 denotes individuals without CKM risk factors and emphasizes primordial prevention to preserve ideal cardiovascular health.\n• Stage 1 identifies excess and/or dysfunctional adiposity, including patients with prediabetes or early glucose dysregulation who carry future CKD and CVD risk despite normal eGFR.\n• Stage 2 captures metabolic risk factors and moderate- to high-risk CKD, integrating blood pressure, atherogenic lipids, glycemia, and albuminuria as modifiable risk drivers.\n• Stage 3 combines subclinical cardiovascular disease or very-high-risk CKD or high predicted CVD risk and signals the need for intensified guideline-directed prevention.\n• Stage 4 denotes clinical cardiovascular disease and is subdivided into 4a (without kidney failure) and 4b (with kidney failure), reflecting distinct therapeutic priorities and constraints.\n• The framework is explicitly designed to align team-based care, biomarkers, imaging, and pharmacotherapy with stage-appropriate risk and expected absolute benefit.\n• Adoption of the staging framework aims to reduce missed opportunities for early organ-protective therapy across cardiology, nephrology, endocrinology, and primary care interfaces."
        },
        "epidemiology": {
          "title": "Epidemiology, Burden, and Prognosis",
          "content": "• CKM syndrome is highly prevalent and accounts for a large share of cardiovascular events, incident heart failure, and premature mortality in the general population.\n• The burden of CKM is concentrated among individuals with obesity, insulin resistance, and type 2 diabetes, with compounding risk from hypertension and atherogenic dyslipidemia.\n• Chronic kidney disease multiplies cardiovascular risk at every stage, such that albuminuria and reduced eGFR independently and jointly forecast myocardial infarction, stroke, heart failure, and sudden death.\n• Life expectancy decreases markedly with advanced CKD, and the presence of moderate to severe albuminuria portends substantially higher cardiovascular and all-cause mortality even when eGFR is preserved.\n• Population-level screening gaps in albuminuria testing lead to systematic underrecognition of high-risk individuals who would benefit from organ-protective therapies.\n• The economic impact of CKM is driven by recurrent cardiovascular hospitalization, dialysis initiation, and productivity loss related to multimorbidity.\n• Disparities in CKM reflect structural and social determinants of health, with disproportionate disease burden in communities with limited access to preventive services and healthy food environments.\n• The rising prevalence of obesity and diabetes in younger adults indicates that CKM risk is beginning earlier in the life course, expanding the at-risk population for decades to come.\n• Early intervention that couples lifestyle, weight management, and pharmacologic organ protection has the greatest potential to bend long-term event rates and costs."
        },
        "pathophysiology": {
          "title": "Mechanisms and Organ Crosstalk",
          "content": "• Excess and ectopic adiposity create a proinflammatory, insulin-resistant milieu characterized by adipokine imbalance, lipotoxicity, oxidative stress, and endothelial dysfunction.\n• Persistent hyperglycemia and dysinsulinemia accelerate glomerular hyperfiltration, mesangial expansion, and tubulointerstitial fibrosis, thereby driving albuminuria and progressive declines in eGFR.\n• RAAS activation, sympathetic overactivity, and altered nitric-oxide signaling amplify sodium retention, arterial stiffness, and microvascular rarefaction with downstream cardiac remodeling.\n• Uremic toxins, mineral and bone disorder, and metabolic acidosis contribute to vascular calcification, myocardial fibrosis, and arrhythmogenic substrate as kidney function declines.\n• Inflammation and immune activation link metabolic syndrome to atherosclerosis, plaque vulnerability, and impaired ischemic preconditioning in the myocardium.\n• Renal sodium–glucose cotransporter activity, impaired tubular oxygen handling, and renal medullary hypoxia form a mechanistic bridge from diabetes to CKD progression.\n• Cardiorenal–metabolic feedback loops propagate injury bidirectionally, such that heart failure exacerbates renal venous congestion and kidney injury, while CKD accelerates myocardial fibrosis, diastolic dysfunction, and conduction abnormalities.\n• Hepatic steatosis and obstructive sleep apnea frequently coexist and further intensify systemic inflammation, sympathetic tone, and insulin resistance within CKM.\n• The net effect of CKM biology is a stepwise, mutually reinforcing increase in cardiovascular and kidney events that justifies earlier and broader initiation of organ-protective therapies."
        },
        "screening": {
          "title": "Screening, Early Detection, and Biomarkers",
          "content": "• All patients with diabetes, hypertension, obesity, or established ASCVD should undergo both eGFR estimation and urine albumin-to-creatinine ratio measurement to detect CKD risk that is missed by creatinine alone.\n• Albuminuria should be confirmed on at least two measurements three months apart, and transient causes such as urinary tract infection or acute illness should be excluded.\n• Metabolic syndrome should be assessed using waist circumference, HDL-C, triglycerides, blood pressure, and fasting glucose, with lower waist thresholds applied for many Asian populations.\n• Lipoprotein-centered risk should be quantified with non-HDL cholesterol or apoB when available, and persistent triglycerides ≥150 mg/dL on statins should prompt consideration of icosapent ethyl in high-risk patients.\n• Subclinical atherosclerosis can be quantified with coronary artery calcium scoring to refine statin intensity and to identify candidates for additional risk-lowering therapies when CAC burden is high.\n• Subclinical heart failure can be identified with natriuretic peptides, high-sensitivity troponin, and echocardiography in patients with CKM risk, enabling stage B interventions before symptoms occur.\n• Blood pressure assessment should include home or ambulatory monitoring when white-coat or masked hypertension is suspected, and orthostatic measurements should be obtained in older adults and those with autonomic symptoms.\n• Lifestyle, diet quality, physical activity, sleep health, tobacco exposure, and alcohol use should be screened systematically because these levers significantly modify CKM trajectory.\n• Structured screening for social determinants of health should be incorporated into workflows with referral pathways to food, transportation, financial, and housing resources."
        },
        "risk_stratification": {
          "title": "Risk Stratification and Stage Integration",
          "content": "• CKM stage assignment should integrate eGFR and albuminuria categories with metabolic risk burden and evidence of subclinical cardiovascular or heart failure disease.\n• The eGFR–uACR heat map provides graded risk categories for kidney failure, cardiovascular events, and mortality that rise steeply as albuminuria increases and eGFR declines.\n• Individuals with very-high-risk CKD (e.g., eGFR <30 mL/min/1.73 m² or severely increased albuminuria) should be managed as cardiovascular risk equivalents regardless of lipid levels.\n• Elevated coronary artery calcium, especially CAC ≥100 Agatston units or high age-adjusted percentiles, indicates subclinical ASCVD and should trigger high-intensity statin therapy and consideration of adjunctive agents.\n• Elevated natriuretic peptides or high-sensitivity troponin and echocardiographic abnormalities identify stage B heart failure and justify early institution of medications that prevent clinical HF.\n• Risk models that include kidney measures improve calibration for 10-year CVD and HF prediction compared with lipid-only or blood pressure-only approaches.\n• Absolute risk and anticipated absolute risk reduction should guide therapy intensity, with shared decision-making that displays outcomes in natural frequencies.\n• Patients who meet multiple high-risk criteria across kidney and cardiovascular domains should be prioritized for multidrug, organ-protective regimens and close follow-up.\n• Longitudinal risk should be recalibrated after therapeutic changes to reinforce adherence and to capture dynamic improvements in albuminuria and blood pressure."
        },
        "therapies": {
          "title": "Therapeutic Priorities and Sequencing",
          "content": "• Lifestyle and weight management are foundational across all stages, with structured nutrition therapy, increased physical activity, sleep optimization, and tobacco cessation producing meaningful reductions in CKM risk.\n• Anti-obesity pharmacotherapy and metabolic surgery should be considered for patients with severe obesity or obesity-related complications when lifestyle measures alone are insufficient.\n• SGLT2 inhibitors should be initiated in patients with CKD, diabetes, or high heart failure risk when eGFR is above the product-specific threshold, with practical initiation considered at eGFR ≥20 mL/min/1.73 m² in most cases.\n• GLP-1 receptor agonists should be prioritized for patients with type 2 diabetes who have high atherosclerotic risk, high insulin requirements, or severe obesity, and they can be combined with SGLT2 inhibitors for complementary benefit.\n• ACE inhibitors or ARBs should be used as first-line agents for albuminuric CKD to reduce intraglomerular pressure, slow eGFR decline, and lower cardiovascular events.\n• Finerenone should be considered for patients with type 2 diabetes and albuminuric CKD on optimized RAAS blockade, provided eGFR and serum potassium criteria are met and potassium can be monitored.\n• Statins are foundational for ASCVD risk reduction, with high-intensity therapy indicated for very-high-risk CKM or high CAC, and PCSK9 inhibitors or bempedoic acid may be added when LDL-C targets are not attained.\n• Icosapent ethyl should be considered for residual triglyceride-rich lipoprotein risk in statin-treated patients with CKM and elevated triglycerides.\n• Blood pressure should generally be targeted to <130/80 mmHg when tolerated, using combinations that include RAAS blockade and diuretics, and individualized based on orthostatic symptoms and comorbidities."
        },
        "subclinical_disease": {
          "title": "Subclinical ASCVD and Heart Failure: Triggers for Action",
          "content": "• A non-zero CAC score reclassifies many intermediate-risk individuals to higher observed event rates and supports high-intensity statin therapy.\n• A CAC score of 100 Agatston units or greater identifies a group with event rates that justify intensification of lipid-lowering beyond statins in many CKM patients.\n• Elevated NT-proBNP or BNP in asymptomatic patients with CKM indicates heightened heart failure risk and guides early initiation of therapies that reduce HF hospitalization.\n• High-sensitivity troponin elevations in CKM reflect diffuse myocardial injury and should prompt aggressive control of blood pressure, lipids, and glycemia.\n• Echocardiographic evidence of left ventricular hypertrophy, diastolic dysfunction, or reduced ejection fraction identifies stage B heart failure and should initiate ACE inhibitor or ARB and evidence-based beta-blocker therapy.\n• Identification of subclinical disease should be communicated to patients using visual tools that translate biomarker or imaging results into absolute risk and potential risk reduction with therapy.\n• Detection of subclinical disease should also trigger assessment of adherence barriers, medication affordability, and care coordination needs to ensure persistence with therapy.\n• Repeat biomarker or imaging assessment should be reserved for uncertainty resolution or major management changes rather than routine intervals without clinical indication.\n• Subclinical disease pathways should be embedded in clinical workflows to minimize delays between detection and initiation of organ-protective therapy."
        },
        "care_models_sdoh": {
          "title": "Care Models, Implementation, and Social Determinants",
          "content": "• CKM care should be team-based and integrate cardiology, nephrology, endocrinology, primary care, pharmacy, and nutrition services to deliver coordinated prevention.\n• Standardized order sets and pathways should bundle albuminuria testing, eGFR monitoring, lipid management, and blood pressure targets with prompts for organ-protective therapy initiation.\n• Electronic health record tools should surface CKM stage, eGFR–uACR risk categories, and recent biomarker trends at the point of care to drive timely actions.\n• Population health dashboards should identify care gaps such as missing uACR, untreated albuminuria, absent statin in high-risk patients, or lack of SGLT2 inhibitor in eligible CKD.\n• Medication access programs, pharmacist-led titration, and home blood pressure or glucose monitoring should be leveraged to overcome adherence and cost barriers.\n• Systematic screening for social needs should be linked to closed-loop referrals to community resources, with follow-up to confirm successful connection and resolution of barriers.\n• Care navigators and community health workers should be incorporated to improve engagement, clinic attendance, and longitudinal therapy persistence.\n• Learning health systems should continuously measure CKM metrics and iterate care pathways based on outcomes and equity dashboards.\n• Implementation should prioritize simplicity, clinician time protection, and patient-facing education that explains absolute risk and the impact of each therapy."
        },
        "operations_followup": {
          "title": "Practical Thresholds, Safety Monitoring, and Follow-Up",
          "content": "• eGFR and uACR should be repeated at least annually in CKM patients and more frequently after therapy changes, acute illness, or rapid eGFR decline.\n• SGLT2 inhibitors can be initiated when eGFR is above the label-specified cutoff, with an anticipated small initial eGFR dip that stabilizes over subsequent weeks; therapy should generally be continued unless progressive decline or intolerance occurs.\n• GLP-1 receptor agonists require education on gastrointestinal adverse effects and titration schedules, and they should be paired with nutrition support to maximize weight and glycemic benefits.\n• ACE inhibitors, ARBs, and finerenone require baseline and follow-up serum potassium and creatinine, with earlier checks in patients with advanced CKD, heart failure, or concomitant diuretic use.\n• Hyperkalemia risk should be mitigated with dietary counseling, diuretic optimization, and, when necessary, potassium binders to preserve the mortality and kidney benefits of RAAS pathway inhibition.\n• Statin therapy adherence should be reinforced with discussion of absolute risk reduction and management of perceived muscle symptoms, and nonstatin therapy should be considered when LDL-C goals are unmet.\n• Blood pressure targets should be individualized using home monitoring data, and orthostatic symptoms should prompt medication adjustments and volume status evaluation.\n• Cardiometabolic vaccination status, including influenza and pneumococcal vaccines, should be reviewed and updated because infection precipitates decompensation in CKM.\n• Follow-up intervals should shorten during medication initiation and titration and then extend once stability is achieved, with each visit recalculating absolute risk and reviewing shared decision-making plans."
        }
      }
    },
    "gdmt": {
      "title": "Guideline-Directed Medical Therapy (GDMT) for CKD and Cardiovascular Risk",
      "sections": {
        "overview": {
          "title": "Concept and Four Pillars",
          "content": "• Guideline-directed medical therapy (GDMT) in CKD-especially when diabetes and cardiovascular risk are present-refers to systematic use of therapies with proven kidney, heart, and survival benefits layered on top of lifestyle care.\n• The core pharmacologic pillars for CKD with type 2 diabetes are renin–angiotensin system (RAS) blockade with an ACE inhibitor or ARB, SGLT2 inhibitor therapy, a nonsteroidal mineralocorticoid receptor antagonist (nsMRA) such as finerenone, and a GLP-1 receptor agonist for patients with high atherosclerotic risk or obesity.\n• Statins (and icosapent ethyl for persistent triglycerides) are foundational for ASCVD risk reduction and should be co-implemented alongside the four kidney-protective pillars.\n• These therapies act through complementary mechanisms that reduce intraglomerular hypertension, albuminuria, inflammatory and fibrotic signaling, and heart failure risk while improving long-term eGFR slope."
        },
        "indications": {
          "title": "Eligibility and When to Start",
          "content": "• Initiate an ACE inhibitor or ARB in adults with CKD and persistent albuminuria (uACR ≥30 mg/g), regardless of diabetes status, unless contraindicated.\n• Initiate an SGLT2 inhibitor in most adults with CKD and eGFR at or above the product-specific threshold; in contemporary practice, a pragmatic initiation threshold is eGFR ≥20 mL/min/1.73 m² for dapagliflozin or empagliflozin, with continuation below this level if tolerated to preserve kidney and heart benefits.\n• Add finerenone in adults with type 2 diabetes, eGFR ≥25 mL/min/1.73 m², uACR ≥30 mg/g despite maximally tolerated RAS blockade, and serum potassium ≤4.8–5.0 mmol/L.\n• Add a GLP-1 receptor agonist (e.g., semaglutide, liraglutide, dulaglutide) for additional ASCVD risk reduction, weight loss, and potential kidney benefit, particularly when A1c remains above target or obesity is present.\n• Use high-intensity statin therapy for very-high ASCVD risk or when coronary calcium is elevated, and consider icosapent ethyl for triglycerides ≥150 mg/dL on statin therapy.\n• Consider sacubitril/valsartan, beta-blockers, and other heart-failure–directed drugs in patients with HFrEF, integrating CKD-specific monitoring to maintain proven life-saving therapies."
        },
        "sequencing": {
          "title": "Rapid and Risk-Based Implementation",
          "content": "• Favor a rapid-sequence or accelerated risk-based approach rather than the traditional slow, stepwise additions over many months.\n• Prioritize patients with very-high risk by KDIGO heat map categories or with a 5-year kidney-failure risk ≥15% by the Kidney Failure Risk Equation (KFRE) for accelerated initiation of all four pillars.\n• Aim to complete initiation of ACEi/ARB, SGLT2 inhibitor, and finerenone (if eligible) within 2–6 weeks, adding a GLP-1 receptor agonist in parallel or shortly thereafter when indicated.\n• Reassess blood pressure, uACR, eGFR, and potassium within 2–4 weeks of each start or uptitration, and continue rapid optimization unless clinically unsafe."
        },
        "dosing": {
          "title": "Starting Doses, Thresholds, and Titration",
          "content": "• Start ACE inhibitors or ARBs at low to moderate dose (e.g., lisinopril 5–10 mg daily, losartan 50 mg daily) and uptitrate every 2–4 weeks to the maximally tolerated or target guideline dose to reduce albuminuria and protect kidney function.\n• Start SGLT2 inhibitors at the trial-validated fixed dose without uptitration (e.g., dapagliflozin 10 mg daily or empagliflozin 10 mg daily) and continue during minor intercurrent illness unless dehydration or ketoacidosis risk is present.\n• Start finerenone 10 mg daily when eGFR 25–<60 mL/min/1.73 m² or 20 mg daily when eGFR ≥60 mL/min/1.73 m², and uptitrate to 20 mg daily if serum potassium remains ≤4.8–5.0 mmol/L after 4 weeks.\n• Start GLP-1 receptor agonists using labeled titration to minimize gastrointestinal adverse effects (e.g., semaglutide 0.25 mg weekly → 0.5 mg → 1.0 mg, as tolerated).\n• Use high-intensity statins when indicated (e.g., atorvastatin 40–80 mg or rosuvastatin 20–40 mg) and add nonstatin therapy if LDL-C goals are not met."
        },
        "safety_monitoring": {
          "title": "Laboratory Monitoring and Expected Changes",
          "content": "• Check serum creatinine/eGFR and potassium 1–2 weeks after starting or uptitrating ACEi/ARB, sacubitril/valsartan, or finerenone, and again at 4 weeks, then space to every 3–6 months when stable.\n• Accept an acute creatinine rise up to ~30% or an eGFR dip of ~3–6 mL/min/1.73 m² after starting RAS blockade or sacubitril/valsartan, and continue therapy if the patient is clinically stable and potassium is acceptable.\n• Expect an early eGFR dip of ~3–5 mL/min/1.73 m² after SGLT2 inhibitor initiation, followed by a slower long-term eGFR decline; continue therapy unless there is progressive decline or clinical instability.\n• Monitor uACR at 3 months to quantify antialbuminuric response and again at least every 6–12 months to track disease trajectory and treatment effect.\n• Reinforce sick-day rules for SGLT2 inhibitors (hold during prolonged fasting, severe illness, or major surgery to reduce euglycemic DKA risk) and resume promptly when oral intake and hemodynamics normalize."
        },
        "potassium_management": {
          "title": "Hyperkalemia Prevention and Response",
          "content": "• Obtain a baseline potassium before starting finerenone or up-titrating ACEi/ARB, and mitigate risk with dietary counseling, diuretic optimization, and review of concurrent potassium-raising drugs.\n• If potassium is 5.1–5.5 mmol/L on finerenone or RAS blockade, reduce dose, optimize loop or thiazide diuretics, and recheck potassium within 1–2 weeks.\n• If potassium exceeds 5.5 mmol/L, hold finerenone or down-titrate ACEi/ARB, address reversible causes, consider potassium binders to maintain organ-protective therapy, and reintroduce when potassium is ≤5.0 mmol/L.\n• Separate monitoring of potassium and creatinine is essential because hyperkalemia and worsening renal function do not always occur together."
        },
        "hf_overlap": {
          "title": "Heart Failure GDMT in the Context of CKD",
          "content": "• Maintain life-saving HFrEF therapies (ACEi/ARB/ARNI, evidence-based beta-blocker, MRA, SGLT2 inhibitor) in CKD whenever possible, because benefits generally extend down to eGFR 30 mL/min/1.73 m² and often to stage 4 for SGLT2 inhibitors with careful monitoring.\n• Recognize that small early eGFR declines after initiating RAS inhibitors, ARNI, MRA, or SGLT2 inhibitors are usually hemodynamic and not a reason to discontinue if the patient is otherwise stable.\n• Use diuretics to achieve euvolemia, anticipating higher loop-diuretic doses in advanced CKD due to reduced tubular delivery of drug.\n• Add vericiguat or omecamtiv mecarbil in selected high-risk HFrEF patients after foundational therapy, acknowledging limited data at very low eGFR and the need for routine renal and electrolyte surveillance."
        },
        "special_populations": {
          "title": "Advanced CKD, Elderly, and Peri-Illness Care",
          "content": "• In stage 4 CKD (eGFR 15–29 mL/min/1.73 m²), continue SGLT2 inhibitors if already established and consider initiating when feasible, while intensifying monitoring for volume status and kidney function during illness.\n• In very advanced CKD (eGFR <15 mL/min/1.73 m²) or dialysis, prioritize individualized goals; continue statins for ASCVD prevention if already prescribed, and coordinate heart-failure therapies with nephrology for volume and potassium management.\n• In older or frail adults, preserve organ-protective therapy while tailoring blood-pressure and glycemic targets to symptoms, orthostatic risk, and comorbidity burden.\n• During acute illness, hypotension, or major surgery, consider temporary holds of RAS blockade or SGLT2 inhibitors based on clinical judgment, and re-start promptly once the precipitant resolves."
        },
        "operations": {
          "title": "Workflow, Quality, and Adherence",
          "content": "• Use electronic prompts to surface CKD stage, uACR, eGFR trajectory, and current GDMT at the point of care, and to identify gaps such as missing uACR testing or absent SGLT2 inhibitor or finerenone in eligible patients.\n• Embed a rapid-initiation playbook that schedules labs at 1–2 and 4 weeks with pharmacist follow-up, and that pre-authorizes therapies commonly blocked by payers.\n• Track a concise dashboard: percentage with annual uACR and eGFR (KED measure), percentage of eligible patients on ACEi/ARB, SGLT2 inhibitor, statin, and finerenone, percentage achieving ≥30% uACR reduction, and rates of hyperkalemia-related therapy interruption.\n• Provide patient education that translates absolute risk and absolute risk reduction into natural frequencies and shows expected changes in creatinine, eGFR, and potassium so that transient laboratory shifts do not undermine adherence."
        }
      }
    },
    "sglt2i": {
      "title": "SGLT2 Inhibitors",
      "sections": {
        "overview": {
          "title": "What SGLT2 Inhibitors Do and Why They Matter",
          "content": "• Sodium–glucose cotransporter-2 (SGLT2) inhibitors block glucose and sodium reabsorption in the proximal tubule, producing glucosuria and natriuresis with downstream cardiorenal benefits that extend beyond glucose lowering.\n• The class reduces intraglomerular pressure by restoring tubuloglomerular feedback, which lowers single-nephron hyperfiltration and translates into a small early dip in eGFR followed by long-term preservation of GFR slope.\n• SGLT2 inhibitors lower albuminuria by approximately 25–40% within months, and the antialbuminuric effect is observed in patients with and without diabetes when background renin–angiotensin system (RAS) blockade is used.\n• The drugs lower heart-failure risk rapidly through osmotic diuresis, natriuresis, and interstitial decongestion, and they reduce HF hospitalization across the ejection-fraction spectrum independent of diabetes status.\n• Additional systemic effects include modest weight loss (≈2–3 kg), small systolic blood pressure reductions (≈3–5 mmHg), lower uric acid (≈0.5–1.0 mg/dL), increased hematocrit, and improved metabolic efficiency—all contributing to cardiovascular and kidney protection."
        },
        "guidelines": {
          "title": "What do the guidelines say about SGLT2i?",
          "content": "For HFrEF:\nIn patients with symptomatic chronic HFrEF, SGLT2i are recommended to reduce hospitalization for HF and cardiovascular mortality, irrespective of the presence of type 2 diabetes. (Class 1)\nIn patients with symptomatic chronic HFrEF, SGLT2i therapy provides intermediate economic value. (Value Statement: Intermediate Value A)\n\nFor HFmrEF:\nIn patients with HFmrEF, SGLT2i can be beneficial in decreasing HF hospitalizations and cardiovascular mortality. (Class 2a)\n\nFor HFpEF:\nIn patients with HFpEF, SGLT2i can be beneficial in decreasing HF hospitalizations and cardiovascular mortality. (Class 2a)\n\nFor Diabetic Kidney Disease:\nWe recommend treating patients with type 2 diabetes (T2D), CKD, and an eGFR ≥20 ml/min per 1.73 m^2 with an SGLT2i. (Class 1A)\n\nPractice Point 1.3.1: The recommendation for SGLT2i is for kidney and cardiovascular protection and SGLT2i have been shown to have safety and benefit in CKD patients, even for those without T2D. Thus, if patients are already being treated with other glucose-lowering agents, an SGLT2i can be added to the current treatment regimen.\n\nPractice Point 1.3.2: The choice of an SGLT2i should prioritize agents with documented kidney or cardiovascular benefits and take eGFR into account.\n\nPractice Point 1.3.3: It is reasonable to withhold SGLT2i during times of prolonged fasting, surgery, or critical medical illness (when patients may be at greater risk for ketosis).\n\nPractice Point 1.3.4: If a patient is at risk for hypovolemia, consider decreasing thiazide or loop diuretic dosages before commencement of SGLT2i treatment, advise patients about symptoms of volume depletion and low blood pressure, and follow up on volume status after drug initiation.\n\nPractice Point 1.3.5: A reversible decrease in the eGFR with commencement of SGLT2i treatment may occur and is generally not an indication to discontinue therapy.\n\nPractice Point 1.3.6: Once an SGLT2i is initiated, it is reasonable to continue an SGLT2i even if the eGFR falls below 20 ml/min per 1.73 m^2, unless it is not tolerated or kidney replacement therapy is initiated.\n\nPractice Point 1.3.7: SGLT2i have not been adequately studied in kidney transplant recipients, who may benefit from SGLT2i treatment, but are immunosuppressed and potentially at increased risk for infections; therefore, the recommendation to use SGLT2i does not apply to kidney transplant recipients.\n\nFor Chronic Kidney Disease:\nWe recommend treating patients with type 2 diabetes (T2D), CKD, and an eGFR ≥20 ml/min per 1.73 m^2 with an SGLT2i. (Class 1A)\n\nOnce an SGLT2i is initiated, it is reasonable to continue an SGLT2i even if the eGFR falls below 20 ml/min per 1.73 m^2, unless it is not tolerated or KRT is initiated.\n\nIt is reasonable to withhold SGLT2i during times of prolonged fasting, surgery, or critical medical illness (when people may be at greater risk for ketosis).\n\nWe recommend treating adults with CKD with an SGLT2i for the following: (Class 1A)\n• eGFR ≥20 ml/min per 1.73 m^2 with urine ACR ≥200 mg/g (≥20 mg/mmol)\n• Heart failure, irrespective of level of albuminuria\n\nSGLT2i initiation or use does not necessitate alteration of frequency of CKD monitoring and the reversible decrease in eGFR on initiation is generally not an indication to discontinue therapy.\n\nWe suggest treating adults with eGFR 20 to 45 ml/min per 1.73 m^2 with urine ACR <200 mg/g (<20 mg/mmol) with an SGLT2i. (Class 2B)",
          "source": "2022 AHA/ACC/HFSA Guideline for the Management of Heart Failure; KDIGO 2022 Clinical Practice Guideline for Diabetes Management in Chronic Kidney Disease; KDIGO 2024 Clinical Practice Guideline for the Evaluation and Management of Chronic Kidney Disease (CKD)",
          "doi": "https://doi.org/10.1161/CIR.0000000000001063; https://doi.org/10.1016/j.kint.2022.06.008; https://doi.org/10.1016/j.kint.2023.10.018"
        },
        "mechanisms": {
          "title": "Renal and Cardiac Mechanisms of Benefit",
          "content": "• Renal hemodynamics: Increased distal sodium delivery activates macula densa signaling, causing afferent arteriolar vasoconstriction and reduced intraglomerular pressure that slows hyperfiltration-mediated injury.\n• Tubular energetics: Reduced proximal tubular transport workload decreases cortical oxygen demand and mitigates medullary hypoxia, oxidative stress, and inflammatory signaling in the nephron.\n• Albuminuria pathways: Lower intraglomerular pressure and improved endothelial glycocalyx integrity reduce albumin flux across the glomerular barrier, complementing RAS blockade to lower uACR.\n• Cardiac preload/afterload: Osmotic diuresis and natriuresis reduce interstitial volume and blood pressure without marked sympathetic activation, improving ventricular loading conditions.\n• Myocardial substrate and mitochondrial effects: Shifts toward greater ketone and free-fatty-acid utilization, modestly higher hematocrit, and improved myocardial energetics contribute to anti-HF benefits even in non-diabetic patients.\n• Anti-arrhythmic milieu: Reductions in atrial and ventricular stretch, fibrosis signaling, and systemic inflammation may lower incident AF and sudden death risk in high-risk phenotypes.\n• Uricemia and endothelial function: Decreases in serum uric acid and improvements in endothelial function support vascular protection over time."
        },
        "indications": {
          "title": "Who Should Get an SGLT2 Inhibitor",
          "content": "• Chronic kidney disease: Adults with CKD and uACR ≥30 mg/g or eGFR 20–45 mL/min/1.73 m² (even with low albuminuria) are candidates for SGLT2 inhibitor therapy to slow CKD progression and reduce kidney failure and cardiovascular events.\n• Type 2 diabetes with CKD or high HF risk: Patients with T2D plus albuminuria or reduced eGFR should receive an SGLT2 inhibitor regardless of baseline HbA1c or metformin use to reduce CKD progression and HF events.\n• Heart failure (with or without diabetes): Patients with HFrEF or HFpEF benefit from SGLT2 inhibitors to reduce the composite of CV death or HF hospitalization and to improve symptoms and health status.\n• Atherosclerotic risk prevention: In high-risk cardiometabolic profiles (e.g., CKM syndrome), SGLT2 inhibitors can be layered with statins, RAS blockade, finerenone, and GLP-1 receptor agonists to address complementary pathways.\n• Not for type 1 diabetes or pregnancy: Routine use in type 1 diabetes is contraindicated due to DKA risk, and the class should be avoided in pregnancy and during breastfeeding."
        },
        "dosing": {
          "title": "Starting Doses and eGFR Thresholds",
          "content": "• Empagliflozin: Start 10 mg once daily for CKD or HF indications; a 25 mg dose can be used for glycemic control but is not required for cardiorenal efficacy.\n• Dapagliflozin: Start 10 mg once daily for CKD or HF indications; the 5 mg tablet is generally for glycemic titration and not needed for kidney or HF benefits.\n• Canagliflozin: Use 100 mg once daily for diabetic kidney disease; higher doses (300 mg) are for glycemic control and are not necessary for renal/CV outcomes.\n• Ertugliflozin: Typical glycemic doses are 5–15 mg daily, but dedicated kidney-outcomes evidence is limited compared with empagliflozin and dapagliflozin.\n• eGFR initiation: A pragmatic threshold for starting empagliflozin or dapagliflozin for CKD/HF benefit is eGFR ≥20 mL/min/1.73 m², with continuation below this level until dialysis or transplant if tolerated.\n• Early eGFR dip: Expect a reversible 3–5 mL/min/1.73 m² decline in eGFR over the first 2–4 weeks; continue therapy unless there is progressive decline, symptomatic hypotension, or other instability.\n• Diuretics: Consider reducing loop-diuretic dose in euvolemic patients at initiation to avoid hypotension or prerenal azotemia, then re-titrate to clinical targets."
        },
        "safety": {
          "title": "Adverse Effects and How to Mitigate Them",
          "content": "• Genital mycotic infections: Expect higher rates of yeast infections (especially in the first months) that respond to topical or short-course oral antifungals; emphasize hygiene and early symptom reporting.\n• Euglycemic ketoacidosis: Rare but serious risk is increased in patients with insulin-treated diabetes, severe carbohydrate restriction, or acute illness; educate patients on warning symptoms (nausea, abdominal pain, malaise), check ketones when unwell, and use sick-day holds.\n• Volume depletion and hypotension: Osmotic diuresis can cause dizziness or orthostasis in older adults or those on high-dose diuretics; adjust diuretics and counsel on fluid intake while avoiding over-replacement.\n• AKI signal: Trials show reduced AKI with SGLT2 inhibitors overall, but transient creatinine rises can occur; assess for hemodynamic contributors if rises exceed ~30%.\n• Fournier’s gangrene: Very rare necrotizing fasciitis of the perineum has been reported; instruct patients to seek urgent care for severe genital pain, swelling, or fever.\n• Amputation and fracture: A CANVAS-program signal for amputations and fractures with canagliflozin was not reproduced consistently in later kidney-outcomes trials; maintain foot care vigilance in PAD or neuropathy and avoid unnecessary diuretic-driven volume depletion.\n• UTIs and dysuria: Rates are generally similar to placebo, but dysuria or frequency can increase; manage symptomatically and evaluate for infection when febrile or systemic symptoms occur."
        },
        "sick_day_periop": {
          "title": "Sick-Day Rules and Peri-Procedural Management",
          "content": "• Acute illness holds: Temporarily hold SGLT2 inhibitors during prolonged fasting, reduced oral intake, vomiting/diarrhea, hypotension, or severe systemic illness to reduce the risk of euglycemic DKA and prerenal AKI.\n• Perioperative holds: Stop canagliflozin, dapagliflozin, and empagliflozin at least 3 days before elective surgery and stop ertugliflozin at least 4 days before; restart when the patient is hemodynamically stable and eating/drinking normally.\n• Contrast procedures: Routine holding before iodinated contrast is not required, but consider a 24–48 hour hold in patients with tenuous volume status or rapidly changing kidney function, especially when multiple nephrotoxins are present.\n• Resumption: Resume promptly once hydration and nutrition are adequate to maintain continuity of cardiorenal protection."
        },
        "monitoring": {
          "title": "What to Check and When",
          "content": "• Baseline: Obtain serum creatinine/eGFR, uACR, electrolytes, and blood pressure before initiation to document starting risk and to enable post-start comparisons.\n• Early follow-up: Recheck creatinine/eGFR and blood pressure within 1–2 weeks in higher-risk patients (advanced CKD, high diuretic dose, borderline blood pressure), otherwise within 4 weeks, to confirm the expected early eGFR dip and hemodynamic stability.\n• Albuminuria response: Reassess uACR at approximately 3 months; a 25–40% reduction supports continued therapy and signals improved kidney prognosis.\n• Glycemia: In T2D, modest HbA1c reductions occur at higher eGFR; at lower eGFR the glycemic effect attenuates but cardiorenal benefits persist, so therapy should not be discontinued for lack of HbA1c change.\n• Volume status and diuretics: Revisit diuretic dosing and orthostatic symptoms after initiation, especially in older adults, those with HF, or those on combination diuretic therapy.\n• Education reinforcement: At each visit, revisit sick-day rules, genital hygiene, and DKA symptom recognition to sustain adherence and minimize preventable adverse events."
        },
        "outcomes_evidence": {
          "title": "Key Outcomes Evidence at a Glance",
          "content": "• Kidney protection: In albuminuric CKD with or without diabetes, SGLT2 inhibitors reduce the composite of sustained eGFR decline, kidney failure, or kidney/CV death with relative risk reductions on the order of 28–40% and slow chronic eGFR slope by ≈1–2 mL/min/1.73 m² per year.\n• Non-diabetic CKD: Benefits extend to non-diabetic CKD, including patients with eGFR 20–45 mL/min/1.73 m² irrespective of albuminuria and those with eGFR 45–90 mL/min/1.73 m² with albuminuria, showing consistent reductions in kidney-disease progression.\n• Heart failure across EF: In HFrEF and HFpEF, SGLT2 inhibitors reduce the composite of CV death or HF hospitalization by ≈18–26%, with early separation of event curves and consistent benefit regardless of diabetes.\n• Mortality and hospitalization: The class lowers total HF hospitalizations and often reduces CV death in HFrEF; pooled analyses show reductions in all-cause hospitalizations and improvements in health status metrics.\n• Safety balance: Trial programs demonstrate lower AKI rates versus placebo, low absolute rates of DKA in T2D, and predictable increases in genital mycotic infections that are manageable with anticipatory guidance.\n• Add-on to foundational therapy: Benefits are additive to RAS blockade, statins, and MRAs, and complementary with finerenone and GLP-1 receptor agonists in high-risk CKM phenotypes."
        }
      }
    },
    "glp1ra": {
      "title": "GLP-1 Receptor Agonists",
      "sections": {
        "overview": {
          "title": "What GLP-1 Receptor Agonists Do and Why They Matter in CKD",
          "content": "• Glucagon-like peptide-1 receptor agonists (GLP-1RA) are incretin-based therapies that enhance glucose-dependent insulin secretion, suppress glucagon, slow gastric emptying, and reduce appetite, leading to clinically meaningful improvements in glycemia and weight in patients with type 2 diabetes who also have chronic kidney disease.\n• Beyond glycemic effects, GLP-1RA reduce atherosclerotic cardiovascular disease (ASCVD) events in high-risk patients with type 2 diabetes, and they improve kidney endpoints primarily by reducing new or worsening albuminuria and mitigating long-term eGFR decline when layered on renin–angiotensin system blockade and other guideline-directed therapies.\n• GLP-1RA are effective across a broad eGFR range without dose adjustment for agents most commonly used in CKD (e.g., liraglutide, semaglutide, dulaglutide), making them practical add-ons in multidisciplinary, cardiorenal-metabolic care pathways."
        },
        "guidelines": {
          "title": "What do the guidelines say about GLP-1 RA?",
          "content": "KDIGO 2024 CKD Guideline:\nRecommendation 3.9.1: In adults with T2D and CKD who have not achieved individualized glycemic targets despite use of metformin and SGLT2 inhibitor treatment, or who are unable to use those medications, we recommend a long-acting GLP-1 RA (1B).\nPractice Point 3.9.1: The choice of GLP-1 RA should prioritize agents with documented cardiovascular benefits.\n\nKDIGO 2022 Diabetes in CKD Guideline:\nRecommendation 4.2.1: In patients with T2D and CKD who have not achieved individualized glycemic targets despite use of metformin and SGLT2i treatment, or who are unable to use those medications, we recommend a long-acting GLP-1 RA (1B).\nPractice Point 4.2.1: The choice of GLP-1 RA should prioritize agents with documented cardiovascular benefits.",
          "source": "KDIGO 2024 Clinical Practice Guideline for the Evaluation and Management of Chronic Kidney Disease; KDIGO 2022 Clinical Practice Guideline for Diabetes Management in Chronic Kidney Disease",
          "doi": "10.1016/j.kint.2023.10.018; 10.1016/j.kint.2022.06.008"
        },
        "mechanisms": {
          "title": "Renal and Cardiovascular Mechanisms of Benefit",
          "content": "• Vascular and anti-inflammatory effects include improvements in endothelial function, reductions in oxidative stress and systemic inflammatory signaling, and favorable changes in surrogate measures of arterial stiffness that together lower ASCVD risk over time.\n• Metabolic effects include reductions in post-prandial glucose excursions, fasting glucose, and body weight that collectively decrease glucotoxicity, lipotoxicity, and insulin resistance—all of which contribute to slower CKD progression.\n• Kidney effects include consistent reductions in urine albumin-to-creatinine ratio driven by hemodynamic and anti-inflammatory pathways distinct from SGLT2 inhibition, suggesting complementary mechanisms when the two classes are used together.\n• Cardiac effects include reductions in major adverse cardiovascular events in type 2 diabetes with high ASCVD risk and favorable impacts on cardiometabolic risk factors such as blood pressure and body weight that support durable benefit."
        },
        "indications": {
          "title": "Who Should Get a GLP-1RA in CKD",
          "content": "• Adults with type 2 diabetes and CKD who require additional ASCVD risk reduction beyond statins, blood pressure control, and SGLT2 inhibition are appropriate candidates for a GLP-1RA with proven cardiovascular benefit.\n• Adults with type 2 diabetes and CKD who need further glycemic control despite metformin and/or SGLT2 inhibitor therapy should receive a GLP-1RA because efficacy persists at lower eGFR and hypoglycemia risk is low when not combined with insulin or sulfonylureas.\n• Adults with CKD and obesity whose weight contributes to hypertension, dyslipidemia, or poor glycemic control may receive added clinical benefit from GLP-1RA-mediated weight loss as part of cardiorenal risk reduction, recognizing that the primary intent in this page is CKD care rather than weight management alone.\n• Use in non-diabetic CKD remains an evolving area with growing supportive data for kidney and cardiovascular outcomes, but most robust evidence for GLP-1RA currently resides in patients with type 2 diabetes and CKD."
        },
        "dosing": {
          "title": "Starting Doses, Titration, and Renal Considerations",
          "content": "• Liraglutide is typically initiated at 0.6 mg subcutaneously daily for one week, then increased to 1.2 mg daily and to 1.8 mg daily as tolerated, and no dose adjustment is required for renal impairment, including advanced CKD not on dialysis.\n• Semaglutide (subcutaneous) is typically initiated at 0.25 mg weekly for four weeks, then increased to 0.5 mg weekly and to 1.0 mg weekly as needed for additional glycemic and cardiometabolic benefit, and no renal dose adjustment is required.\n• Dulaglutide is typically initiated at 0.75 mg weekly, then increased to 1.5 mg weekly and, if needed and tolerated, to 3.0 mg weekly and 4.5 mg weekly, and no renal dose adjustment is required across CKD stages.\n• Exenatide and lixisenatide rely on renal clearance and are generally avoided in advanced CKD; for simplicity in CKD care pathways, prefer liraglutide, semaglutide, or dulaglutide.\n• When GLP-1RA therapy is added to background insulin or sulfonylurea, a proactive dose reduction of the insulin prandial component or sulfonylurea should be considered to minimize hypoglycemia as glycemic control improves.\n• In advanced CKD with poor oral intake or intercurrent illness, temporarily defer up-titration until nutrition and volume status are stable to reduce gastrointestinal adverse effects."
        },
        "safety": {
          "title": "Adverse Effects, Contraindications, and Mitigation",
          "content": "• Gastrointestinal adverse effects such as nausea, early satiety, vomiting, and diarrhea are dose related and typically abate with slow titration; schedule-based titration should pause if moderate symptoms persist rather than forcing escalation.\n• Gallbladder disease risk is modestly increased; patients with biliary colic, gallstones, or prior cholecystitis should be counseled about symptom monitoring and evaluated promptly for right upper quadrant pain or fever.\n• Pancreatitis is uncommon but has been reported; new severe, persistent abdominal pain with vomiting warrants drug interruption and diagnostic evaluation for pancreatitis.\n• Diabetic retinopathy complications have been observed with rapid A1c lowering, particularly with semaglutide; patients with proliferative or severe non-proliferative retinopathy should undergo baseline ophthalmology assessment and experience gradual glycemic improvement to minimize early worsening.\n• Volume depletion and acute kidney injury can occur secondary to vomiting or poor intake; CKD patients should receive explicit sick-day guidance to maintain hydration and seek care early for persistent gastrointestinal losses.\n• GLP-1RA are contraindicated in patients with a personal or family history of medullary thyroid carcinoma or in those with multiple endocrine neoplasia syndrome type 2, and they should be avoided in pregnancy and during breastfeeding."
        },
        "sick_day_periop": {
          "title": "Sick-Day Rules and Peri-Procedural Management",
          "content": "• During acute intercurrent illness with reduced oral intake, significant nausea or vomiting, or dehydration, GLP-1RA should be temporarily held to reduce the risk of volume depletion, acute kidney injury, and aspiration with delayed gastric emptying.\n• For elective procedures that require anesthesia or deep sedation, clinicians should coordinate with local anesthesia policy on perioperative management of GLP-1RA given their effects on gastric emptying; many centers hold daily agents on the day of procedure and schedule weekly agents to avoid a dose immediately before the procedure.\n• Therapy should be resumed when oral intake is reliable and hemodynamics are stable, with the prior maintenance dose re-introduced rather than re-titrating unless gastrointestinal symptoms recur."
        },
        "monitoring": {
          "title": "What to Monitor and When",
          "content": "• Glycemic control should be reassessed with fasting glucose and hemoglobin A1c about 3 months after initiation or dose change, with earlier checks in patients at hypoglycemia risk due to concomitant insulin or sulfonylurea therapy.\n• Kidney status should be monitored with eGFR and urine albumin-to-creatinine ratio at baseline and again at approximately 3–6 months to document the expected reduction in albuminuria and to track eGFR trajectory alongside other kidney-protective therapies.\n• Weight, blood pressure, and cardiometabolic profile should be reviewed at each visit because reductions in adiposity and blood pressure contribute to cardiovascular and kidney benefits.\n• Ophthalmology follow-up should be ensured in patients with baseline diabetic retinopathy, particularly during periods of rapid glycemic improvement, to detect and manage early worsening.\n• Adverse effects including gastrointestinal symptoms, gallbladder complaints, and signs of pancreatitis should be actively queried at follow-up, with management plans that avoid unnecessary discontinuation when symptoms are mild and transient."
        },
        "combination_strategy": {
          "title": "How GLP-1RA Fit with SGLT2 Inhibitors, RAAS Blockade, and Finerenone",
          "content": "• GLP-1RA and SGLT2 inhibitors provide complementary mechanisms of kidney and cardiovascular protection, and combined therapy is appropriate for many patients with type 2 diabetes and CKD who have residual albuminuria, elevated ASCVD risk, or persistent obesity after initiation of first-line agents.\n• GLP-1RA should be layered on background ACE inhibitor or ARB therapy in albuminuric CKD because reductions in glomerular pressure and albuminuria are additive and translate into improved long-term kidney outcomes.\n• Finerenone can be combined with GLP-1RA and SGLT2 inhibitors in albuminuric diabetic CKD to address fibrotic and inflammatory pathways not targeted by incretin therapy, with routine potassium and creatinine monitoring to maintain safety of the mineralocorticoid pathway therapy.\n• In risk-based sequencing, SGLT2 inhibitors are often initiated first when CKD or heart-failure risk predominates, and GLP-1RA are prioritized first when ASCVD risk, severe obesity, or high insulin requirements predominate; in many CKD patients, both classes are indicated and should be instituted within weeks rather than months."
        },
        "outcomes_evidence": {
          "title": "Key Outcomes Evidence Relevant to CKD",
          "content": "• Large cardiovascular outcomes trials in type 2 diabetes demonstrate that several GLP-1RA reduce major adverse cardiovascular events, with consistent benefit in subgroups with chronic kidney disease.\n• Kidney outcomes across trials show significant reductions in new or worsening albuminuria and signals for slower eGFR decline and fewer composite kidney events when GLP-1RA are layered on standard of care, supporting their role as kidney-protective therapies in diabetic CKD.\n• Emerging randomized evidence indicates that dedicated kidney-focused GLP-1RA programs reduce clinically meaningful kidney outcomes and cardiovascular events in patients with type 2 diabetes and CKD, reinforcing their use alongside SGLT2 inhibitors and renin–angiotensin–aldosterone system blockade.\n• Safety analyses across CKD strata show that GLP-1RA are generally well tolerated without the need for renal dose adjustment for commonly used agents, with predictable gastrointestinal events that are manageable with slow titration and supportive care."
        }
      }
    },
    "nsmra": {
      "title": "Non-steroidal Mineralocorticoid Receptor Antagonists",
      "sections": {
        "overview": {
          "title": "What Finerenone (nsMRA) Does and Why It Matters in CKD",
          "content": "• Finerenone is a highly selective, nonsteroidal mineralocorticoid receptor antagonist (nsMRA) that blocks aldosterone/MR signaling to reduce inflammation and fibrosis in the kidney and heart.\n• Unlike steroidal MRAs (spironolactone, eplerenone), finerenone has minimal off-target sex-hormone receptor activity, is not used as a diuretic, and was developed specifically for cardiorenal protection in CKD associated with type 2 diabetes.\n• In CKD with diabetes, finerenone lowers albuminuria, slows chronic eGFR decline, reduces kidney-failure composites, and lowers major cardiovascular events when layered on maximally tolerated ACE inhibitor or ARB therapy."
        },
        "guidelines": {
          "title": "What do the guidelines say about nsMRA?",
          "content": "For Diabetic Kidney Disease:\nRecommendation 1.4.1: We suggest a nonsteroidal mineralocorticoid receptor antagonist with proven kidney or cardiovascular benefit for patients with T2D, an eGFR ≥25 ml/min per 1.73 m^2, normal serum potassium concentration, and albuminuria (≥30 mg/g [≥3 mg/mmol]) despite maximum tolerated dose of RAS inhibitor (RASi). (Class 2A)\n\nPractice Point 1.4.1: Nonsteroidal MRA are most appropriate for patients with T2D who are at high risk of CKD progression and cardiovascular events, as demonstrated by persistent albuminuria despite other standard-of-care therapies.\n\nPractice Point 1.4.2: A nonsteroidal MRA can be added to a RASi and an SGLT2i for treatment of T2D and CKD.\n\nPractice Point 1.4.3: To mitigate risk of hyperkalemia, select patients with consistently normal serum potassium concentration and monitor serum potassium regularly after initiation of a nonsteroidal MRA.\n\nPractice Point 1.4.4: The choice of a nonsteroidal MRA should prioritize agents with documented kidney or cardiovascular benefits.\n\nPractice Point 1.4.5: A steroidal MRA should be used for treatment of heart failure, hyperaldosteronism, or refractory hypertension, but may cause hyperkalemia or a reversible decline in glomerular filtration, particularly among patients with a low GFR.\n\nFor Chronic Kidney Disease:\nWe suggest a nonsteroidal mineralocorticoid receptor antagonist with proven kidney or cardiovascular benefit for adults with T2D, an eGFR >25 ml/min per 1.73 m^2, normal serum potassium concentration, and albuminuria (>30 mg/g [>3 mg/mmol]) despite maximum tolerated dose of RAS inhibitor (RASi). (Class 2A)\n\nNonsteroidal MRA are most appropriate for adults with T2D who are at high risk of CKD progression and cardiovascular events, as demonstrated by persistent albuminuria despite other standard-of-care therapies.\n\nA nonsteroidal MRA may be added to a RASi and an SGLT2i for treatment of T2D and CKD in adults.\n\nTo mitigate risk of hyperkalemia, select people with consistently normal serum potassium concentration and monitor serum potassium regularly after initiation of a nonsteroidal MRA.\n\nThe choice of a nonsteroidal MRA should prioritize agents with documented kidney or cardiovascular benefits.\n\nA steroidal MRA may be used for treatment of heart failure, hyperaldosteronism, or refractory hypertension, but may cause hyperkalemia or a reversible decline in glomerular filtration, particularly among people with a low GFR.",
          "source": "KDIGO 2022 Clinical Practice Guideline for Diabetes Management in Chronic Kidney Disease; KDIGO 2024 Clinical Practice Guideline for the Evaluation and Management of Chronic Kidney Disease (CKD)",
          "doi": "https://doi.org/10.1016/j.kint.2022.06.008; https://doi.org/10.1016/j.kint.2023.10.018"
        },
        "mechanisms": {
          "title": "Renal and Cardiovascular Mechanisms of Benefit",
          "content": "• Mineralocorticoid receptor overactivation promotes tubular–interstitial inflammation, collagen synthesis, and myocardial/renal fibrosis; finerenone antagonizes these pathways to slow structural disease progression.\n• Finerenone has balanced distribution to heart and kidney tissues and modulates pro-inflammatory/pro-fibrotic gene programs (e.g., TGF-β, MCP-1) without meaningful antiandrogen/progestin effects seen with steroidal MRAs.\n• Reductions in albuminuria reflect improvements in glomerular and tubular health that translate into better long-term kidney outcomes independent of short-term hemodynamic changes.\n• Cardiovascular benefits include fewer heart-failure events and a reduction in composite atherosclerotic outcomes, likely via anti-inflammatory, antifibrotic, and vascular effects rather than natriuresis."
        },
        "indications": {
          "title": "Who Should Get Finerenone",
          "content": "• Adults with CKD associated with type 2 diabetes, already on maximally tolerated ACE inhibitor or ARB, are appropriate candidates when serum potassium is acceptable and eGFR permits initiation.\n• A pragmatic clinical profile is persistent albuminuria (uACR ≥30 mg/g) and eGFR ≥25 mL/min/1.73 m² despite RAAS blockade, with no recent hyperkalemia; this mirrors trial populations and real-world deployment.\n• Do not initiate if baseline serum potassium >5.0 mEq/L; correct reversible causes of hyperkalemia first and re-evaluate eligibility.\n• Consider finerenone even at higher eGFR in albuminuric patients because risk is driven by albuminuria as well as GFR; albuminuria reduction is a treatment target linked to improved prognosis."
        },
        "dosing_titration": {
          "title": "Starting Dose, Titration, and Targets",
          "content": "• Start 20 mg once daily if eGFR ≥60 mL/min/1.73 m² and serum potassium ≤5.0 mEq/L; start 10 mg once daily if eGFR is 25–<60 mL/min/1.73 m².\n• The target dose for CKD with diabetes is 20 mg once daily if potassium permits; measure serum potassium 4 weeks after initiation and after any dose change.\n• If on 10 mg and potassium ≤4.8 mEq/L, increase to 20 mg; if potassium >4.8–5.5 mEq/L, maintain current dose; if potassium >5.5 mEq/L, withhold and consider restarting at 10 mg once potassium ≤5.0 mEq/L.\n• If eGFR falls >30% from the previous value at the 4-week check, maintain 10 mg rather than uptitrating; small early creatinine/eGFR changes are expected and usually stabilize by ~4 weeks."
        },
        "safety_monitoring": {
          "title": "Adverse Effects and Laboratory Monitoring",
          "content": "• The most frequent adverse reaction is hyperkalemia; hypotension and hyponatremia are less common but reported.\n• Check serum potassium and eGFR prior to initiation, again at ~4 weeks, after any dose change, and periodically thereafter (e.g., every 3–4 months when stable, more often if higher risk).\n• Risk factors for hyperkalemia include lower eGFR, higher baseline potassium, high dietary potassium, concomitant potassium-sparing drugs, and metabolic acidosis; address reversible contributors proactively.\n• Consider potassium binders, adding or optimizing loop/thiazide diuretics, and dietary counseling to maintain nsMRA therapy when mild to moderate hyperkalemia occurs."
        },
        "drug_interactions": {
          "title": "Interactions That Matter in Practice",
          "content": "• Strong CYP3A4 inhibitors (e.g., itraconazole, clarithromycin, ritonavir) are contraindicated because they markedly raise finerenone exposure; avoid grapefruit/grapefruit juice.\n• Strong or moderate CYP3A4 inducers (e.g., rifampin, carbamazepine, phenytoin, efavirenz) can reduce finerenone exposure substantially and should be avoided.\n• Moderate/weak CYP3A4 inhibitors (e.g., verapamil, diltiazem, erythromycin, amiodarone) increase exposure; continue with closer potassium monitoring and adjust finerenone dose if needed.\n• Concurrent potassium-raising agents (e.g., potassium supplements, trimethoprim, high-dose RAAS blockade, other MRAs) increase hyperkalemia risk; review and rationalize the regimen when starting finerenone."
        },
        "combination_strategy": {
          "title": "How Finerenone Fits with SGLT2i, GLP-1RA, and RAAS Blockade",
          "content": "• Finerenone should be layered on top of maximally tolerated ACE inhibitor or ARB in albuminuric diabetic CKD, addressing fibrotic/inflammatory pathways not targeted by SGLT2 inhibitors or GLP-1RA.\n• Co-administration with SGLT2 inhibitors is appropriate and clinically complementary; event reduction is additive across kidney and cardiovascular outcomes, and observational and trial-level analyses suggest similar or lower hyperkalemia risk when SGLT2 inhibitors are on board.\n• GLP-1RA may be added for ASCVD risk reduction and albuminuria lowering; combination therapy across RAAS blockade + SGLT2i + nsMRA ± GLP-1RA is increasingly standard for high-risk CKD phenotypes.\n• In risk-based sequencing, initiate SGLT2 inhibitor and nsMRA within weeks when albuminuria is ≥30 mg/g and eGFR ≥25 mL/min/1.73 m², with potassium monitoring to keep all pillars active."
        },
        "outcomes_evidence": {
          "title": "Key Outcomes Evidence at a Glance",
          "content": "• FIDELIO-DKD (CKD with T2D on ACEi/ARB) showed a 18% relative risk reduction in the primary kidney composite (kidney failure, ≥40% sustained eGFR decline, or renal death; HR ≈0.82) and a 14% reduction in the key cardiovascular composite (CV death, MI, stroke, or HF hospitalization; HR ≈0.86).\n• FIGARO-DKD (earlier CKD with T2D, albuminuria-enriched) showed a 13% relative risk reduction in the primary cardiovascular composite (CV death, MI, stroke, or HF hospitalization; HR ≈0.87) driven in part by fewer HF hospitalizations (HR ≈0.71), with favorable kidney signals.\n• The prespecified pooled FIDELITY analysis (N ≈13,000) demonstrated a 14% reduction in the composite cardiovascular outcome (HR ≈0.86) and a 23% reduction in a key kidney composite (HR ≈0.77), with consistent benefit across eGFR strata and baseline ASCVD status.\n• Hyperkalemia-related discontinuation occurred more often with finerenone than placebo but remained infrequent overall, and no hyperkalemia-related deaths were observed in the trials."
        }
      }
    },
    "krfe": {
      "title": "Kidney Failure Risk Equation (KFRE)",
      "sections": {
        "overview": {
          "title": "Purpose, Scope, and Model Family",
          "content": "• The Kidney Failure Risk Equation (KFRE) estimates the absolute probability of progression from chronic kidney disease (CKD) stages G3–G5 to kidney failure requiring dialysis or kidney transplant within 2 and 5 years.\n• Two commonly implemented versions are the 4-variable model (age, sex, eGFR, and urine albumin-to-creatinine ratio [ACR]) and the 8-variable model (the 4-variable inputs plus serum calcium, phosphate, bicarbonate, and albumin).\n• KFREs were derived in referred CKD cohorts and subsequently validated across 31 multinational cohorts, supporting use in both nephrology and primary-care settings when inputs are measured and transformed correctly.\n• The models provide risk estimates that are directly interpretable at the bedside and easily embedded in electronic health records for automated, event-horizon–specific reporting (2- and 5-year risks).\n• Because absolute risk depends on both the linear predictor and the cohort baseline hazard, calibration to local populations can materially improve accuracy when the background event rate differs from development cohorts.\n• KFRE is intended for adults with established CKD (eGFR <60 mL/min/1.73 m²) and should not be used to prognosticate individuals with preserved kidney function or acute kidney injury.\n• Adoption of KFRE enables risk-triggered care processes such as timed nephrology referral, vascular access planning, transplant education, and initiation of guideline-directed medical therapy for CKD progression delay.\n• The equations estimate the probability of kidney failure irrespective of cause, and therefore complement but do not replace disease-specific assessments (e.g., suspected GN, ADPKD)."
        },
        "models_and_equations": {
          "title": "Model Structure and Risk Computation",
          "content": "• KFREs are Cox proportional hazards models with a log-linear predictor composed of centered covariates and a baseline survival S0(t) at t = 2 or 5 years.\n• The general risk formula is: Predicted Risk at time t = 1 − [S0(t)]^(exp(Linear Predictor)), where the Linear Predictor is the weighted sum of the centered inputs.\n• The preferred 4-variable KFRE uses age (years), sex (male/female), eGFR (mL/min/1.73 m²), and ln(ACR) with variables centered at prespecified means from the derivation cohort; the 8-variable KFRE adds calcium, phosphate, bicarbonate, and albumin.\n• Albuminuria enters the model on the natural-log scale, which improves linearity and stability across the wide clinical range of ACR.\n• For implementations outside North America, recalibration of S0(t) (i.e., adjusting the baseline hazard while retaining original coefficients) can correct systematic over- or under-prediction due to different background event rates.\n• When KFRE is embedded in software, use the cohort-specific S0(t) (or a regionally recalibrated S0(t)) corresponding to the 2- and 5-year horizons; do not substitute ad hoc baselines from other models.\n• The 6-variable variant (adding diabetes and hypertension) is described in the literature but is less commonly implemented than the 4- and 8-variable versions for routine clinical use."
        },
        "variable_measurement_and_units": {
          "title": "Inputs, Standardization, and Transformations",
          "content": "• eGFR should be computed with the CKD-EPI creatinine equation (2009 in the original validations) using IDMS-traceable creatinine; if creatinine is not IDMS-standardized, a −5% correction was applied in validations.\n• Albuminuria should be expressed as urine ACR in mg/g and log-transformed as ln(ACR); if only protein–creatinine ratio, 24-hour urine protein, or dipstick are available, convert to ACR using validated equations before risk calculation.\n• When ACR is reported in mg/mmol, convert to mg/g before taking logs (ACR[mg/g] = ACR[mg/mmol] ÷ 0.113), which is equivalent to multiplying by ~8.85.\n• Serum albumin in the 8-variable model should be entered in g/dL (or converted to g/L per the specification used by a given implementation) and centered consistently with the development study.\n• Serum calcium, phosphate, and bicarbonate should be obtained from contemporaneous labs and entered in mg/dL (calcium, phosphate) and mEq/L (bicarbonate), ensuring units match the equation specification.\n• Sex should be coded as a binary indicator consistent with the derivation model; do not substitute gender identity for the biological-sex variable used in the equation without validation.\n• Use the most recent stable measurements near the index date; avoid using values obtained during acute intercurrent illness or immediately pre-dialysis."
        },
        "validation_and_performance": {
          "title": "Discrimination and External Validation",
          "content": "• Across 31 cohorts (n ≈ 721,000; ≈23,800 kidney-failure events; median follow-up ≈4.2 years), the original 4-variable KFRE demonstrated excellent discrimination with overall C ≈ 0.90 at 2 years and ≈ 0.88 at 5 years.\n• The original 8-variable KFRE showed C ≈ 0.89 at 2 years and ≈ 0.86 at 5 years, with similar performance across age, sex, race, region, and diabetes subgroups.\n• Pooled refit coefficients from random-effects meta-analysis did not meaningfully improve discrimination compared with the original published coefficients.\n• Discrimination exceeded 0.80 in nearly all cohorts and remained robust in sensitivity analyses limited to cohorts with quantified albuminuria as opposed to dipstick protein measurements.\n• Performance of the 8-variable model was marginally higher than the 4-variable model in cohorts where all eight labs were available, but the incremental gain must be balanced against availability and missingness of inputs.\n• Subgroup analyses did not reveal clinically important heterogeneity in C statistics by diabetes status, age ≥65 years, or race categories used in the validating cohorts."
        },
        "calibration_and_regional_adjustment": {
          "title": "Baseline Risk, Recalibration, and Error Metrics",
          "content": "• Calibration of the original KFREs was generally adequate in North American cohorts but showed systematic over-prediction in several non–North American cohorts due to lower baseline hazards.\n• Allowing the intercept (baseline hazard) to vary by cohort while holding coefficients fixed identified region as the principal driver of baseline risk differences.\n• Applying regional calibration factors that reduced the baseline risk by approximately 33% at 2 years and 17% at 5 years improved root-mean-squared error and calibration in most non–North American cohorts.\n• Brier score–based comparisons and observed-vs-predicted plots across predefined risk strata (e.g., 0–<2%, 2–<6%, 6–<10%, 10–<20%, ≥20% at 2 years) are recommended to verify local calibration when deploying KFRE.\n• When implementing KFRE in new health systems, recalibrate S0(t) to the local background rate of kidney failure using event-weighted methods rather than altering the published covariate coefficients unless a full local refit is planned."
        },
        "clinical_thresholds_and_use_cases": {
          "title": "Risk Cutoffs for Referral and Planning",
          "content": "• A 5-year KFRE threshold of >3% has been used as a trigger for nephrology referral in Manitoba, where it demonstrated ≈97% sensitivity, ≈62% specificity, and ≈99% negative predictive value for progression to kidney failure.\n• Use of a >3% over 5 years threshold in a risk-based triage pathway was associated with a reduction in median nephrology wait times from ≈230 days to ≈58 days while prioritizing higher-risk patients.\n• In UK primary care analyses, adopting a KFRE-based threshold (e.g., >3%–5% over 5 years) reclassified a substantial fraction of referrals versus NICE criteria, highlighting over-referral driven by transient eGFR declines in otherwise low-risk patients.\n• Draft UK guidance has considered >5% 5-year risk as an alternative to eGFR <30 mL/min/1.73 m² to reduce unnecessary referrals while maintaining focus on higher-risk patients.\n• For vascular access planning, adding a 2-year KFRE threshold (e.g., >40%) to conventional eGFR-based referral improved the proportion of patients starting hemodialysis with a functioning AV fistula/graft and reduced too-early access creation.\n• KFRE thresholds should be contextualized with patient age, life expectancy, and competing risks; a single universal cutoff may not optimize utility across all health systems."
        },
        "implementation_and_workflow": {
          "title": "Embedding KFRE in Care Pathways",
          "content": "• Ensure albuminuria testing is performed routinely; under-measurement of ACR (e.g., only ~37% tested in some primary-care CKD cohorts) limits KFRE deployment and can systematically miss high-risk patients.\n• Build unit checks and conversions into the calculator (e.g., mg/mmol → mg/g) and validate that log transforms are applied after the correct unit standardization.\n• Automate risk display within laboratory reports and CKD dashboards at the time of eGFR/ACR testing, and surface 2- and 5-year risks with clear date-stamps and trend visualization.\n• Couple KFRE outputs to action prompts, such as ‘refer now,’ ‘order AV access evaluation,’ ‘initiate SGLT2 inhibitor/RAAS blockade,’ and ‘schedule transplant education,’ according to locally agreed risk thresholds.\n• Periodically audit calibration and referral outcomes after implementation, and update regional S0(t) parameters if background event rates shift over time with therapy uptake.\n• Include safety checks in triage algorithms so that patients with suspected glomerulonephritis, rapidly progressive clinical syndromes, refractory electrolyte/acid–base disorders, or ADPKD are referred irrespective of KFRE risk."
        },
        "limitations_and_cautions": {
          "title": "Boundaries of Valid Use",
          "content": "• KFRE was developed for adults with CKD G3–G5 and should not be applied to individuals with preserved kidney function, acute kidney injury, or kidney transplant recipients without dedicated validation.\n• KFRE should not be the sole criterion for referral; disease-specific red flags (e.g., hematuria with proteinuria, nephrotic syndrome, suspected systemic autoimmune disease) warrant specialty evaluation regardless of predicted risk.\n• Miscalibration can occur when applying unadjusted North American baselines to regions with different background hazards; uncorrected deployment can overestimate risk and skew triage.\n• Input errors in ACR units or omission of albuminuria will materially degrade accuracy; dipstick protein should be converted to ACR using validated equations before use.\n• The 8-variable model may offer slight discrimination gains but is more vulnerable to missingness and laboratory variability; the 4-variable model often provides the optimal balance of accuracy and feasibility.\n• Competing risks of death prior to kidney failure can influence observed progression rates in older or multimorbid populations and should be considered when interpreting absolute risks and setting thresholds."
        },
        "special_populations_and_edge_cases": {
          "title": "Subgroups and Practical Nuances",
          "content": "• Validation across age, sex, race, diabetes status, and geographic region shows stable discrimination, but calibration differences necessitate region-aware baselines.\n• In older adults with low ACR and slowly falling eGFR, KFRE often predicts low 5-year risk despite CKD stage labels, supporting conservative referral and focus on cardiovascular risk and medication optimization.\n• In younger adults with high ACR and moderately reduced eGFR, KFRE identifies high short-term risk even when eGFR is above traditional referral thresholds, supporting earlier specialty involvement.\n• For patients close to dialysis initiation, using the 2-year risk horizon can better align vascular access timing than fixed eGFR triggers alone.\n• In health systems with long waits or limited nephrology capacity, tiered thresholds (e.g., >5% 5-year for routine referral; >15% 5-year for expedited access) can align demand with resources while maintaining safety nets for red-flag conditions.\n• Periodic recalculation after therapeutic changes (e.g., initiation of SGLT2i or RAAS blockade) is reasonable to re-estimate trajectory, recognizing that KFRE does not explicitly model treatment effects."
        }
      }
    },
    "prevent": {
      "title": "PREVENT Equations (AHA)",
      "sections": {
        "overview": {
          "title": "Overview and Scope",
          "content": "• The PREVENT equations are sex-specific, race-neutral multivariable models from the American Heart Association that estimate absolute cardiovascular risk over 10-year and 30-year horizons in adults without clinical cardiovascular disease.\n• PREVENT outputs separate risks for Total CVD (a composite that includes ASCVD and incident heart failure), ASCVD alone, and Heart Failure alone, allowing clinicians to target therapies by outcome.\n• PREVENT expands traditional ASCVD tools by incorporating kidney and metabolic health via eGFR in the base model and optionally urine albumin-to-creatinine ratio (UACR), hemoglobin A1c (HbA1c), and an area-level Social Deprivation Index (SDI).\n• The models use age as the time scale and account for the competing risk of non-CVD death to improve calibration of absolute risk across short- and long-term horizons."
        },
        "eligible_population": {
          "title": "Eligible Population and Exclusions",
          "content": "• PREVENT is intended for primary prevention in adults aged 30–79 years who do not have prior myocardial infarction, stroke, or clinical heart failure at the time of assessment.\n• The equations should not be used to guide treatment decisions in patients with established clinical ASCVD or clinical heart failure because baseline hazards and effect sizes differ in secondary prevention settings.\n• Variables should reflect stable, usual values; extreme physiologic outliers or laboratory values influenced by acute illness should be repeated and confirmed before risk estimation."
        },
        "predictors": {
          "title": "Predictor Set: Base and Optional",
          "content": "• The base PREVENT models include age, systolic blood pressure (SBP), HDL cholesterol, non–HDL cholesterol, estimated glomerular filtration rate (eGFR), current smoking, antihypertensive-therapy use, statin use, and diabetes status, and every model is sex specific.\n• Optional models add UACR (entered on the natural log scale), HbA1c, and SDI (typically grouped into lower, intermediate, and higher deprivation), and missing-indicator terms permit calculation when one or more optional predictors are unavailable.\n• For heart failure and cardiovascular-death endpoints, body mass index (BMI) replaces lipids because adiposity is a stronger determinant of incident heart failure and CVD mortality than lipid fractions in modern cohorts."
        },
        "functional_forms": {
          "title": "Variable Coding and Functional Forms",
          "content": "• SBP enters as two piecewise-linear terms with a knot at 110 mmHg so that risk is modeled per 20 mmHg below 110 and per 20 mmHg at or above 110, capturing J-shaped relationships at low pressure and monotonic rise at higher pressure.\n• Kidney function enters as piecewise eGFR terms with knots near conventional thresholds so that risk increases with lower eGFR and attenuates at higher eGFR; in implementations, separate terms are used for eGFR below a threshold and eGFR above a threshold.\n• For heart failure models only, BMI enters as two piecewise-linear terms with a knot at 30 kg/m² so that risk is modeled per 5 kg/m² below 30 and per 5 kg/m² at or above 30, reflecting nonlinear adiposity–HF relationships.\n• UACR, when included, is log-transformed to stabilize variance and linearize associations across the broad range of albuminuria encountered in clinical practice."
        },
        "outcomes_horizons": {
          "title": "Outcomes and Time Horizons",
          "content": "• PREVENT reports 10-year and 30-year risks for Total CVD, ASCVD, and Heart Failure, enabling counseling that distinguishes near-term event probability from lifetime cardiometabolic trajectory.\n• Because PREVENT models each endpoint separately and adjusts for competing non-CVD death, the predicted risk for Total CVD is not intended to equal the simple sum of ASCVD and Heart Failure risks, and each output should be interpreted on its own scale.\n• Long-horizon (30-year) risk helps identify younger adults with low 10-year risk but high lifetime risk who merit earlier preventive therapy and closer follow-up."
        },
        "risk_calculation": {
          "title": "How Risk Is Calculated (Practical Notes)",
          "content": "• PREVENT uses sex-specific Cox models with age as the underlying time scale and left truncation at cohort entry, and absolute risk at a given horizon is obtained by combining the individual’s linear predictor with the horizon-specific baseline survival, with competing-risk adjustment for non-CVD death.\n• The linear predictor is computed as the sum of each predictor multiplied by its sex-specific coefficient, including age interactions and the piecewise terms for SBP, eGFR, and BMI where applicable.\n• In implementations that use mg/dL for lipids, non–HDL cholesterol is computed as total cholesterol minus HDL cholesterol; where coefficients expect mmol/L, values are converted using standard factors (e.g., mg/dL × 0.02586 for cholesterol).\n• For optional models, UACR is entered in mg/g on the natural log scale, HbA1c is entered in percent, and SDI is entered as categorical levels; when optional inputs are missing, missing-indicator terms allow unbiased estimation rather than forcing imputation."
        },
        "performance_validation": {
          "title": "Discrimination, Calibration, and Validation",
          "content": "• In multi-cohort validation, discrimination for Total CVD is good with C-statistics around 0.79 in women and around 0.76 in men, and discrimination for incident Heart Failure is higher at roughly 0.83 in women and 0.81 in men.\n• Calibration slopes are generally near 1.0 across sex and race subgroups for 10-year risk, and restriction to five-year horizons preserves calibration, supporting use for shorter-term counseling.\n• Adding eGFR improves calibration among individuals with CKD compared with lipid- and blood-pressure–only models, and adding optional UACR or HbA1c yields incremental gains in discrimination and reclassification, particularly for Heart Failure risk.\n• External validation in nationally representative datasets demonstrates high discrimination for fatal CVD at 10 years with modest calibration drift that is directionally consistent with model development on broader composite endpoints."
        },
        "clinical_application": {
          "title": "Clinical Application and Interpretation",
          "content": "• Use PREVENT to quantify Total CVD and ASCVD risk when making lipid and antihypertensive therapy decisions, and use the Heart Failure risk output to identify patients who may benefit from therapies that reduce incident HF, especially among those with CKD or diabetes.\n• Because PREVENT is race neutral and includes kidney measures, it is well suited for patients with reduced eGFR or albuminuria in whom ASCVD-focused equations may underestimate global cardiovascular risk.\n• Shared decision making should present risks and benefits in natural frequencies and should be followed by serial reassessment after initiation of guideline-directed therapy, recognizing that absolute risk is dynamic and will decline with effective treatment.\n• PREVENT estimates should be interpreted alongside clinical markers of subclinical disease such as coronary artery calcium and cardiac biomarkers, which can further refine therapy intensity."
        },
        "operations": {
          "title": "Data Entry, Units, and Workflow Tips",
          "content": "• Enter SBP as the usual clinic or home value, code antihypertensive therapy and statin therapy as binary variables, and code diabetes status per contemporary diagnostic criteria.\n• Compute non–HDL cholesterol as total cholesterol minus HDL cholesterol in the same units, and convert lipids to mmol/L when coefficients expect mmol/L by multiplying mg/dL by 0.02586.\n• Enter eGFR as mL/min/1.73 m² from a race-free creatinine equation, and when UACR is available, enter mg/g and apply the natural logarithm before multiplying by coefficients in optional models.\n• Avoid summing ASCVD and Heart Failure risks because each model uses distinct baseline hazards and competing-risk adjustments; instead, discuss each risk on its own terms and map therapies to the outcome most likely to be reduced."
        }
      }
    },
    "kdigo": {
      "title": "KDIGO Risk Classification",
      "sections": {
        "overview": {
          "title": "Purpose, Scope, and CGA Framework",
          "content": "• KDIGO classifies chronic kidney disease (CKD) prognosis by combining glomerular filtration rate (GFR) categories (G1–G5) with albuminuria categories (A1–A3) in a color-coded heat map that conveys graded risk for CKD progression, acute kidney injury, cardiovascular events, and mortality.\n• The classification is part of the CGA schema—Cause of CKD, GFR category, and Albuminuria category—so that complete staging reads, for example, as “Diabetic kidney disease, G3bA3.”\n• The heat map colors standardize prognosis language: green indicates low risk (and if no other markers of kidney disease, not CKD), yellow indicates moderately increased risk, orange indicates high risk, and red indicates very high risk.\n• KDIGO recommends using this framework across primary care, cardiology, endocrinology, and nephrology to align detection, monitoring frequency, and intensity of preventive therapies with biologic risk rather than creatinine alone."
        },
        "gfr_categories": {
          "title": "eGFR Categories (G1–G5)",
          "content": "• G1: eGFR ≥90 mL/min/1.73 m² (normal or high) with evidence of kidney damage required to diagnose CKD.\n• G2: eGFR 60–89 mL/min/1.73 m² (mildly decreased) with evidence of kidney damage required to diagnose CKD.\n• G3a: eGFR 45–59 mL/min/1.73 m² (mildly to moderately decreased) and constitutes CKD irrespective of albuminuria.\n• G3b: eGFR 30–44 mL/min/1.73 m² (moderately to severely decreased) with substantially higher event risk than G3a.\n• G4: eGFR 15–29 mL/min/1.73 m² (severely decreased) with very high risk of progression and complications.\n• G5: eGFR <15 mL/min/1.73 m² (kidney failure), typically prompting kidney replacement therapy planning."
        },
        "albuminuria_categories": {
          "title": "Albuminuria Categories (A1–A3) and Units",
          "content": "• A1: ACR <30 mg/g (<3 mg/mmol), termed normal to mildly increased albuminuria.\n• A2: ACR 30–300 mg/g (3–30 mg/mmol), termed moderately increased albuminuria (historically “microalbuminuria”).\n• A3: ACR >300 mg/g (>30 mg/mmol), termed severely increased albuminuria; nephrotic-range albuminuria corresponds to ACR >2,220 mg/g (>250 mg/mmol).\n• When ACR is reported in mg/mmol, convert to mg/g by multiplying by 8.84; when only 24-h albumin excretion or protein measures are available, convert to ACR using validated formulas before classification."
        },
        "measurement_standards": {
          "title": "Testing, Standardization, and Confirmation",
          "content": "• Estimate GFR with a race-free creatinine equation and add cystatin C (eGFRcr-cys) when eGFR is near a clinical decision threshold, when muscle mass is atypical, or when creatinine may be misleading.\n• Measure albuminuria with a spot urine albumin-to-creatinine ratio (ACR), preferably from an early-morning specimen; if ACR is abnormal, repeat to confirm chronicity and exclude transient causes (exercise, fever, urinary tract infection, uncontrolled hyperglycemia).\n• Define CKD by abnormalities present for ≥3 months; explicitly document the date of confirmation for longitudinal staging.\n• Use IDMS-traceable creatinine assays and ensure consistent units for ACR; build automated unit checks into EHR calculators to prevent mg/mmol vs mg/g mix-ups."
        },
        "risk_matrix_interpretation": {
          "title": "How to Read the Heat Map and What the Colors Mean",
          "content": "• Prognosis worsens stepwise as either albuminuria increases (A1→A3) or eGFR declines (G1→G5), with synergistic risk when both are adverse.\n• Green cells (e.g., G1–G2 with A1) denote low risk; if no other markers of kidney damage are present, these combinations do not meet CKD criteria.\n• Yellow cells denote moderately increased risk and warrant structured risk factor control and at least annual monitoring of eGFR and ACR.\n• Orange cells denote high risk and call for intensified therapy, earlier nephrology engagement, and more frequent monitoring (e.g., every 3–6 months depending on trajectory and comorbidity).\n• Red cells denote very high risk and are associated with high probabilities of kidney failure, cardiovascular events, and death; these patients generally require multidisciplinary care, medication optimization, and timely planning for kidney replacement therapies."
        },
        "clinical_actions_by_risk": {
          "title": "Stage-Aligned Clinical Actions",
          "content": "• All categories: Treat blood pressure to evidence-based targets, prescribe statins for indicated ASCVD risk, vaccinate appropriately, avoid nephrotoxins where possible, and counsel on sick-day rules.\n• A2–A3 or any G3–G5: Initiate or optimize ACE inhibitor or ARB for albuminuric CKD unless contraindicated, and add an SGLT2 inhibitor at or above labeled eGFR thresholds for kidney and heart protection.\n• Persistent A3 with T2D and eGFR ≥25 mL/min/1.73 m²: Consider finerenone on top of RAAS blockade with structured potassium monitoring.\n• Very high risk (many G3b–G5 and/or A3): Refer to nephrology for co-management, plan for transplant education and vascular access when appropriate, and manage anemia, acidosis, mineral-bone disorder, and volume with protocolized follow-up.\n• Low risk (G1–G2A1 with a separate marker of kidney disease): Focus on risk factor modification, periodic reassessment of ACR and eGFR, and evaluation of the underlying cause (e.g., structural, genetic, or tubulointerstitial)."
        },
        "dynamic_reassessment": {
          "title": "Trajectory, Reclassification, and Treatment Effects",
          "content": "• Reassess eGFR and ACR after major therapeutic changes to document expected responses (e.g., early eGFR dip after SGLT2i initiation and 25–40% ACR reduction with RAAS blockade/SGLT2i/finerenone).\n• Track slope (mL/min/1.73 m² per year) and ACR trend rather than relying on single values; accelerating decline or rising albuminuria should trigger evaluation for superimposed disease or adherence issues.\n• Reclassify CGA stage when chronicity is established or when abnormalities resolve; a transient ACR elevation does not confer chronic stage unless persistent for ≥3 months.\n• When eGFR is near 60 or 45 mL/min/1.73 m² cutpoints, confirm with eGFRcr-cys to reduce misclassification that could alter management and referral."
        },
        "special_populations": {
          "title": "Populations and Situations Requiring Nuance",
          "content": "• Older adults may have low eGFR with A1 albuminuria yet low short-term progression risk; emphasize cardiovascular risk reduction and medication safety while individualizing nephrology referral.\n• High muscle mass, frailty, amputations, and extreme diets can bias creatinine-based eGFR; consider cystatin C or measured GFR to refine staging when decisions hinge on small differences.\n• Post-AKI patients require reassessment after recovery to distinguish persistent CKD from reversible injury; classify only when chronicity is confirmed.\n• Solitary kidney (surgical or congenital), ADPKD, reflux nephropathy, and glomerulonephritides should be labeled by cause within CGA because prognosis and treatment differ at a given G–A cell."
        },
        "limitations_pitfalls": {
          "title": "Common Pitfalls and How to Avoid Them",
          "content": "• Misuniting ACR (mg/mmol vs mg/g) or using protein-to-creatinine ratio interchangeably without conversion leads to erroneous staging; implement EHR unit safety checks.\n• Classifying CKD from a single abnormal eGFR or ACR obtained during acute illness overcalls disease; repeat testing after recovery to ensure chronicity.\n• Overreliance on eGFR alone misses high-risk patients with preserved eGFR but A2–A3 albuminuria; albuminuria testing must be routine in diabetes, hypertension, and CKM phenotypes.\n• Under-recognizing competing risks in older or multimorbid patients can inflate expectations of kidney-failure events; incorporate overall prognosis and patient goals when applying the heat map to decision thresholds."
        },
        "operations_followup": {
          "title": "Workflow, Reporting, and Monitoring Frequency",
          "content": "• Embed automatic CGA labeling and heat-map color in lab reports whenever eGFR and ACR return, with clear units and date stamps.\n• Default to at least annual eGFR and ACR in yellow cells and more frequent (e.g., every 3–6 months) in orange/red cells, with earlier checks after medication changes or intercurrent illness.\n• Build referral prompts tied to red-zone combinations and to rapid eGFR decline (e.g., >5 mL/min/1.73 m² per year or >30% decline within 3 months) irrespective of absolute stage.\n• Use population dashboards to identify missing ACR testing, untreated albuminuria, lack of SGLT2i/RAAS therapy in eligible patients, and outliers in potassium or bicarbonate that require action."
        }
      }
    }
  },

  "about": {
    "team": [
      {
        "name": "Sharlene Shirali",
        "title": "Medical Student",
        "institution": "UC San Francisco School of Medicine",
        "bio": ".",
        "bioLink": "https://www.washington.edu/undergradresearch/sharlene-shirali/",
        "image": "/images/sharlene-shirali.png"
      },
      {
        "name": "Julio A. Lamprea-Montealegre, MD, PhD",
        "title": "Assistant Professor",
        "institution": "Division of Cardiology, UC San Francisco",
        "bio": ".",
        "bioLink": "https://profiles.ucsf.edu/julio.lampreamontealegre",
        "image": "/images/julio-lamprea.webp"
      },
      {
        "name": "Jiun-Ruey Hu, MD, MPH",
        "title": "Structural/Interventional Cardiology Fellow",
        "institution": "Smidt Heart Institute, Cedars-Sinai Medical Center",
        "bio": ".",
        "bioLink": "https://www.rueyhu.com",
        "image": "/images/jiun-ruey-hu.jpeg"
      }
    ]
  },

  "hazardRatios": {
    "table": [
      {
        "outcome": "MACE (CVD)",
        "sglt2i": "0.87 (0.77, 0.98)",
        "glp1ra": "0.82 (0.68, 0.98)",
        "nsmra": "0.86 (0.78-0.95)"
      },
      {
        "outcome": "Heart Failure Hospitalization",
        "sglt2i": "0.70 (0.65, 0.75)",
        "glp1ra": "Not available",
        "nsmra": "0.78 (0.66-0.92)"
      },
      {
        "outcome": "CKD progression",
        "sglt2i": "0.63 (0.58, 0.69)",
        "glp1ra": "0.79 (0.66, 0.94)",
        "nsmra": "0.77 (0.67-0.88)"
      }
    ]
  },

  "evidence": {
    "sglt2i": {
      "cvd": {
        "title": "SGLT2i Impact on Major Adverse Cardiovascular Events",
        "question": "What do meta-analyses say about the impact of SGLT2i on MACE?",
        "image": "/images/MA SGLT2i MACE.jpg",
        "caption": "Overall effect of sodium-glucose cotransporter-2 inhibition on the major adverse cardiovascular events composite. The forest plot depicts the treatment effect of SGLT2 inhibitors on major adverse cardiovascular events composite at the level of the individual trials, by trial type, and in the overall study population. ASCVD indicates atherosclerotic cardiovascular disease; CANVAS Program, Canagliflozin Cardiovascular Assessment Study; CREDENCE, Canagliflozin and Renal Events in Diabetes With Established Nephropathy Clinical Evaluation; DAPA-CKD, Dapagliflozin and Prevention of Adverse Outcomes in Chronic Kidney Disease; DAPA-HF (Study to Evaluate the Effect of Dapagliflozin on the Incidence of Worsening Heart Failure or Cardiovascular Death in Patients With Chronic Heart Failure), DECLARE-TIMI 58, Dapagliflozin Effect on Cardiovascular Events -- Thrombolysis in Myocardial Infarction 58; DELIVER, Dapagliflozin Evaluation to Improve the Lives of Patients With Preserved Ejection Fraction Heart Failure; EMPA-KIDNEY, The Study of Heart and Kidney Protection With Empagliflozin; EMPA-REG Outcome; 10773 [Empagliflozin] Cardiovascular Outcome Event Trial in Type 2 Diabetes Mellitus Patients; EMPEROR-Preserved, Empagliflozin Outcome Trial in Patients With Chronic Heart Failure With Preserved Ejection Fraction; EMPEROR-Reduced, Empagliflozin Outcome Trial in Patients With Chronic Heart Failure With Reduced Ejection Fraction; FE,fixed effects; RE, random effects; SGLT2, sodium-glucose cotransporter-2; and VERTIS CV, Evaluation of Ertugliflozin Efficacy and Safety Cardiovascular Outcomes Trial.",
        "reference": "Patel et al (2024, Circulation, \"Sodium-Glucose Cotransporter-2 Inhibitors and Major Adverse Cardiovascular Outcomes: A SMART-C Collaborative Meta-Analysis\")",
        "doi": "https://doi.org/10.1161/CIRCULATIONAHA.124.069568"
      },
      "hf": {
        "title": "SGLT2i Impact on Heart Failure Hospitalization",
        "question": "What do meta-analyses say about the impact of SGLT2i on HF hospitalization?",
        "image": "/images/MA SGLT2i HFH.jpg",
        "caption": "Effect of sodium glucose co-transporter-2 inhibition on kidney disease progression by presumed primary kidney disease (chronic kidney disease trials only). Effects in IgA nephropathy, focal segmental glomerulosclerosis, and other glomerular diseases considered separately are provided in the appendix. Rate values are not presented for the combined subtotal and total populations due to the heterogeneity in rates across the individual trials. eGFR=estimated glomerular filtration rate. RR=relative risk. SGLT2i=sodium glucose co-transporter-2 inhibitor. *RR in the diabetic kidney disease or nephropathy subgroup excluding SCORED (which did not formally assess primary kidney disease) is 0·59 (95% CI 0·52--0·68).",
        "reference": "Baigent et al (2022, Lancet, \"Impact of diabetes on the effects of sodium glucose co-transporter-2 inhibitors on kidney outcomes: collaborative meta-analysis of large placebo-controlled trials\")",
        "doi": "https://doi.org/10.1016/S0140-6736(22)02074-8"
      },
      "ckd": {
        "title": "SGLT2i Impact on CKD Progression",
        "question": "What do meta-analyses say about the impact of SGLT2i on CKD progression?",
        "image": "/images/MA SGLT2i CKD.jpg",
        "caption": "Effect of sodium glucose co-transporter-2 inhibition on kidney disease outcomes by diabetes status. Kidney disease progression was defined as a sustained decrease in eGFR (≥50%) from randomisation, a sustained low eGFR, end-stage kidney disease, or death from kidney failure in all presented trials. Outcome definition details for each trial are provided in the appendix. Rate values are not presented for the combined subtotal and total populations due to the heterogeneity in rates across the individual trials. eGFR=estimated glomerular filtration rate. RR=relative risk. SGLT2i=sodium glucose co-transporter-2 inhibitor. NA=not available. *One participant without diabetes in DELIVER was missing a baseline creatinine measurement and was excluded.",
        "reference": "Baigent et al (2022, Lancet, \"Impact of diabetes on the effects of sodium glucose co-transporter-2 inhibitors on kidney outcomes: collaborative meta-analysis of large placebo-controlled trials\")",
        "doi": "https://doi.org/10.1016/S0140-6736(22)02074-8"
      }
    },
    "glp1ra": {
      "cvd": {
        "title": "GLP-1 RA Impact on Major Adverse Cardiovascular Events",
        "question": "What do meta-analyses say about the impact of GLP-1 RA on MACE?",
        "image": "/images/MA GLP1 MACE.png",
        "caption": "Efficacy and Safety Outcomes. Data are for the full analysis population from the in-trial period (from randomization to the end of trial participation). Composite kidney disease events and composite major cardiovascular events were analyzed in a time-to-first-event analysis with the use of a Cox proportional-hazards model with treatment as a categorical fixed factor and stratified according to SGLT2 inhibitor use at baseline. Data from participants without events of interest were censored at the end of their in-trial period. The nominal significance level was updated to 0.0322 with the use of the Lan--DeMets alpha-spending function. The eGFR was calculated with serum creatinine level and the Chronic Kidney Disease Epidemiology Collaboration formula. Events not related to the eGFR were confirmed by the event adjudication committee. \"Persistent\" was defined as two consecutive measurements at least 4 weeks apart fulfilling the criteria. Death from cardiovascular causes, as confirmed by the event adjudication committee, includes both death from cardiovascular causes and death from undetermined causes adjudicated by that committee.",
        "reference": "Perkovic et al (2024, NEJM, \"Effects of Semaglutide on Chronic Kidney Disease in Patients with Type 2 Diabetes\")",
        "doi": "https://doi.org/10.1056/nejmoa2403347"
      },
      "ckd": {
        "title": "GLP-1 RA Impact on CKD Progression",
        "question": "What do meta-analyses say about the impact of GLP-1 RA on CKD progression?",
        "image": "/images/MA GLP1 MACE.png",
        "caption": "Efficacy and Safety Outcomes. Data are for the full analysis population from the in-trial period (from randomization to the end of trial participation). Composite kidney disease events and composite major cardiovascular events were analyzed in a time-to-first-event analysis with the use of a Cox proportional-hazards model with treatment as a categorical fixed factor and stratified according to SGLT2 inhibitor use at baseline. Data from participants without events of interest were censored at the end of their in-trial period. The nominal significance level was updated to 0.0322 with the use of the Lan--DeMets alpha-spending function. The eGFR was calculated with serum creatinine level and the Chronic Kidney Disease Epidemiology Collaboration formula. Events not related to the eGFR were confirmed by the event adjudication committee. \"Persistent\" was defined as two consecutive measurements at least 4 weeks apart fulfilling the criteria. Death from cardiovascular causes, as confirmed by the event adjudication committee, includes both death from cardiovascular causes and death from undetermined causes adjudicated by that committee.",
        "reference": "Perkovic et al (2024, NEJM, \"Effects of Semaglutide on Chronic Kidney Disease in Patients with Type 2 Diabetes\")",
        "doi": "https://doi.org/10.1056/nejmoa2403347"
      }
    },
    "nsmra": {
      "cvd": {
        "title": "nsMRA Impact on Major Adverse Cardiovascular Events",
        "question": "What do meta-analyses say about the impact of nsMRA on MACE?",
        "image": "/images/MA nsMRA MACE.png",
        "caption": "Forest plots of cardiovascular endpoints in the FIGARO-DKD, FIDELIO-DKD, and FIDELITY studies",
        "reference": "Agarwal et al (2022, EHJ, \"Cardiovascular and kidney outcomes with finerenone in patients with type 2 diabetes and chronic kidney disease: the FIDELITY pooled analysis\")",
        "doi": "https://doi.org/10.1093/eurheartj/ehab777"
      },
      "hf": {
        "title": "nsMRA Impact on Heart Failure Hospitalization",
        "question": "What do meta-analyses say about the impact of nsMRA on HF hospitalization?",
        "image": "/images/MA nsMRA MACE.png",
        "caption": "Forest plots of cardiovascular endpoints in the FIGARO-DKD, FIDELIO-DKD, and FIDELITY studies",
        "reference": "Agarwal et al (2022, EHJ, \"Cardiovascular and kidney outcomes with finerenone in patients with type 2 diabetes and chronic kidney disease: the FIDELITY pooled analysis\")",
        "doi": "https://doi.org/10.1093/eurheartj/ehab777"
      },
      "ckd": {
        "title": "nsMRA Impact on CKD Progression",
        "question": "What do meta-analyses say about the impact of nsMRA on CKD progression?",
        "image": "/images/MA nsMRA CKD.png",
        "caption": "Forest plots of kidney endpoints in the FIGARO-DKD, FIDELIO-DKD, and FIDELITY studies",
        "reference": "Agarwal et al (2022, EHJ, \"Cardiovascular and kidney outcomes with finerenone in patients with type 2 diabetes and chronic kidney disease: the FIDELITY pooled analysis\")",
        "doi": "https://doi.org/10.1093/eurheartj/ehab777"
      }
    }
  }
}
